[
  {
    "question": "Are there any popular apps which make use of Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nThere are many popular apps which use Flutter. Some of the apps are:\n\n- Reflectly\n- Google Ads\n- Alibaba\n- Tencent\n- Birch Finance\n- And many more\n\nThe use of Flutter in mobile applications is very high.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Benefits of Flutter Inspector",
    "answer_preview": "**📚 SIMPLILEARN**\n\nFlutter Inspector can:\n\n- Select widget mode in a widget tree\n- Provide the toggle platform\n- Show paint baselines and debug paint\n- Refresh the widgets as well as show or hide the performance overlay\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you name some best editors for Flutter development?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nSome popular IDEs (Integrated Development Environment) for Flutter include the following:\n\n- Android Studio\n- IntelliJ Idea\n- Emac\n- Visual Studio\n- Codemagic\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you name the command used to compile the release mode?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe command `flutter run --release` is used to compile the release mode. Release mode for a web app means that the app is compiled with the dart2js compiler for best performance.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you state a few examples of stateless widget?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nSome examples of a stateless widget include the following:\n\n- **Text** - This displays a string of text with a single style.\n- **Container** - This widget can contain other widgets and provide padding, margins, and other layout properties.\n- **Icon** - This is used for the lis",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us how many kinds of widgets there are in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThere are two main types of widgets in Flutter. These include:\n\n**StatelessWidget** - It does not have any state information. It is static throughout its lifecycle. Examples are Row, Text, Column, and Container.\n\n**StatefulWidget** - It has state information. It contains two c",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us how we can test a single widget in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Widget tests** allow building and interacting with widgets in a test environment. It is used to check whether the Widget works as expected or not. Hence, using this testing UI component, you can test a single widget.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us the four main elements of Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe four main elements of Flutter are:\n\n1. Flutter engine\n2. Widgets\n3. Design-specific widgets\n4. Foundation Library\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us what will be the default return type, if you don't specify the return type for a function?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nIn Flutter, Dart is the programming language used to develop the framework. In Dart, if you don't specify the return type for a function, the default return type will be **dynamic**. This means, if you declare a function in Flutter without specifying a return type, Dart assume",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us what you know about Rune In Dart?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nIn dart programming language strings are a sequence of UTF-16 which is a 16 bit unicode Transformation Format. **Rune** refers to an integer that is used to describe any Unicode code point.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us which class is responsible for implementing the basic material design visual layout structure for an app in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **scaffold class** is a widget in Flutter that is used to implement the basic material design visual layout structure. The scaffold class makes it faster to create a general-purpose mobile application. Moreover, it contains almost everything we need to create a functional ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us which function compiles and updates the app?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nIn Flutter, there are several functions and commands that can be used to compile and update the app. However, the most commonly used function for this purpose is **hot reload**.\n\nHot reload is a development feature in Flutter that allows you to update your app's code in real-t",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell which function is accountable for starting the program?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**main()** function is used to start a program. This function is highly critical as, without it, one cannot write any function.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you use WidgetsApp for basic navigation?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nYes, a material app widget builds a navigator, which manages a stack of widgets identified by strings, also known as routes objects and gives you two ways for managing the stack.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Define spacer widget?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nIn Flutter, the **Spacer widget** is a flexible widget that takes up available space within a Row, Column, or Flex layout. It is commonly used to create vertical or horizontal space between widgets, or to distribute available space between multiple widgets.\n\n> **Note:**\n  **Co",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Difference between runApp() and main() in flutter",
    "answer_preview": "**📚 SIMPLILEARN**\n\n| main() | runApp() |\n|--------|----------|\n| It is a function used to start the program | It is used to return the widgets that are connected to the screen as the root of the widget tree to be rendered on the screen |\n| In Flutter, it is impossible to write any program without th",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Different types of streams in Dart",
    "answer_preview": "**📚 SIMPLILEARN**\n\nThere are two types of streams in Dart: **Single Subscription Streams** and **Broadcast Streams**.\n\n### Single Subscription Streams\n\n- The events within a larger whole are delivered sequentially with single subscription streams\n- They are used for events that are in received matte",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between `mainAxisAlignment` and `crossAxisAlignment`.",
    "answer_preview": "**📚 GITHUB**\n\nThe `mainAxisAlignment` determines how the children should be placed along the main axis in a flex layout. Whereas, the `crossAxisAlignment` determines how the children will be placed along the cross axis in a flex layout.\n\nFor a `Row` widget:\n- **mainAxisAlignment** --> Horizontal axi",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between `StatelessWidget` and `StatefulWidget` in Flutter.",
    "answer_preview": "**📚 GITHUB**\n\n`StatelessWidget`s are those that do not change, or are immutable. Its appearance and properties remain constant throughout the widget's lifetime. **Icon**, **IconButton**, **Text** are examples of stateless widgets.\n\n`StatefulWidget`s are those that change their properties while runni",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between final, const and static keyword.",
    "answer_preview": "**📚 GITHUB**\n\nThe `final` keyword defines a variable that can be initialized once and cannot be changed after being assigned a value for the first time.\n\nThe `const` keyword defines a constant variable that should not be changed over time.\n\nNow the only difference between the final and const variabl",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between Hot Restart and Hot Reload?",
    "answer_preview": "**📚 SIMPLILEARN**\n\n### Hot Restart\n\n- It sets the state value as default by destroying the preserved state value\n- So if you are using States value in your application then after every hot restart the developer gets a fully compiled application and all the states will be set to their defaults\n- Hot ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between named parameters and positional parameters in Flutter.",
    "answer_preview": "**📚 GITHUB**\n\nA `Positional Parameter` is linked by its position. Positional parameters must be specified in the order in which they appear. `Named Parameters` are referenced by name, which means that they can be used during the function invocation in an order different from the function declaration",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain App state",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nApp State may also be referred to as a shared state or application state. It is possible to share app states across sections of your app and maintain user sessions in the same way.\n\nHere are some examples of App State:\n\n- Login info\n- User preferences\n- E-commerce shopping cart\n-",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain BuildContext",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nBuildContexts are used to identify or locate widgets in widget trees. Each widget has its own BuildContext, i.e., one BuildContext per widget. Basically, we're using it to find references to other widgets and themes. In addition, you can utilize it to interact with widget parents",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain Container class in a flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nBasically, in Flutter, a container is a widget that has the capacity to accommodate multiple child widgets and manage them efficiently through dimensions, padding, and background color. Whenever we want to style the background of a widget, either because of a color, shape, or siz",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain Flutter Inspector",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nIn the same manner, as with Native Android, the XML file allows us to view our app's blueprint and properties. There is a powerful tool called Flutter Inspector for Flutter applications that allows you to visualize the blueprint of your widgets and their properties. Using it, you",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain Flutter Provider",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nThe provider is built using widgets. You can use all the objects in the provider as if they were just part of Flutter with the new widget subclasses it creates. This also means that the provider is not cross-platform. The provider is the simplest way to handle state management. B",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain packages and plugins in Flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nA package is a collection of classes, interfaces, and sub-packages that enable the creation of modular code that can be shared easily among users. Applications can be quickly developed using packages instead of developing everything from scratch. You can import new widgets or fun",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain profile mode in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **profile mode** in Flutter is used to test the functionality of an app while launching it. It compiles and launches your app almost identically to release mode but with additional functionality to allow debugging performance problems.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain pubspec.yaml file",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nThe pubspec.yaml file, also known as 'pubspec', is a file that is included when you create a Flutter project and is located at the top of the project tree. This file contains information about the dependencies like packages and their versions, fonts, etc., that a project requires",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain the Flutter Architecture",
    "answer_preview": "**📚 INTERVIEWBIT**\n**📚 SIMPLILEARN**\n\nFlutter architecture is made up of three layers:\n\n- **Upper Layer**: It has Dart programming language including the widgets, animations, illustrations, customizations, etc.\n- **The middle layer**: It is also called the Flutter Engine used for text display, forma",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain the flutter widget and write its importance",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nGenerally, a Flutter app consists of a number of widgets. A widget is a way to declare and construct user interfaces. In Flutter, you must write code inside a widget in order to build anything. With the widget, you can see how your app would appear with its current configuration.",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Explain the term \"Tree shaking\" in Flutter.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Tree shaking** is a method of removing the unused module in the bundle during the development process. Tree shaking serves as a sort of optimization technique that optimizes the code by removing the dead code.\n\nWhile importing or exporting codes, there might be dead codes ha",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Flutter is developed by which company?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Google**\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Flutter is written in which language?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter was written in the **Dart language**. While writing and debugging an application, Flutter runs in the Dart virtual machine, which features a just-in-time execution engine.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How can we create HTTP requests in Flutter?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nTo create HTTP requests, use the HTTP package: `import 'package:http/http.dart' as http;`\n\n### Example:\n\n```dart\nhttp.get('https://jsonplaceholder.typicode.com/albums/1');\n```\n\nIt will return a `Future<http.Response>`.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How can you reduce execution time for running code?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nIt will depend on the size and adaptability of the app packages. According to which we can integrate just-in-time compilers to run code which will enhance the app's performance. Dart code execution is faster than many other languages where Ahead-of-time compilers also shorten ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How can you test a single Widget?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nUsing the **Widget tests** technique, you can make sure that various portions of the user interface work as intended without the need for a physical device or simulator. This technique is the best way to isolate small parts of your app and find out whether your code is behavin",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do Object, dynamic, and var differ in Dart?",
    "answer_preview": "**📚 GITHUB**\n\nIn Dart, Object, dynamic, and var are used for variable declarations but differ in how types are handled:\n\n**Object:** The base class for all types in Dart. Variables declared as Object can hold any type of value, but you need to explicitly cast them when accessing methods or propertie",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you handle background fetch on Android and iOS?",
    "answer_preview": "**📚 LEMON**\n\nUse platform-specific plugins:\n\n### Recommended plugin: workmanager\n```dart\nimport 'package:workmanager/workmanager.dart';\n\nvoid callbackDispatcher() {\n  Workmanager().executeTask((task, inputData) async {\n    // Background fetch logic\n    await fetchData();\n    return Future.value(true",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you manage app state across multiple modules?",
    "answer_preview": "**📚 LEMON**\n\nUse centralized state management solutions:\n\n### Riverpod:\n- Providers accessible from anywhere\n- No BuildContext needed\n- Type-safe and testable\n\n### Bloc/Cubit:\n- Clear separation of business logic\n- Predictable state transitions\n- Great for complex flows\n\n### Redux:\n- Single source o",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you navigate between screens in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, we can navigate between screens using the `Navigator` class. We can push a new screen onto the stack using the `push` method, and pop the current screen off the stack using the `pop` method. We can also use named routes to navigate between screens. To do this, we need to de",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you pass data between screens in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, we can pass data between screens using various methods. Some of the most commonly used methods are:\n\n1. **Using constructor parameters**: We can pass data between screens by passing the required data as parameters to the constructor of the destination screen.\n\n   ```dart\n  ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you persist offline data in Flutter?",
    "answer_preview": "**📚 LEMON**\n\nSeveral options depending on needs:\n\n### For structured data:\n- **sqflite** - SQLite database for relational data\n- **Hive** - Lightweight, fast NoSQL database\n- **ObjectBox** - High-performance NoSQL database with relations\n\n### For simple key-value storage:\n- **shared_preferences** - ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you test a widget that uses animation?",
    "answer_preview": "**📚 LEMON**\n\nUse `WidgetTester` methods:\n\n### pumpAndSettle():\n- Waits for all animations to complete\n- Useful for implicit animations\n\n### pump(Duration):\n- Advances clock by specified duration\n- Simulates animation frames\n- Allows testing specific animation states\n\n```dart\ntestWidgets('Animation t",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you update a large list efficiently without rebuilding the entire list?",
    "answer_preview": "**📚 LEMON**\n\nSeveral optimization strategies:\n\n### 1. Use ListView.builder:\n- Creates items lazily\n- Only renders visible items\n\n### 2. Assign Keys to items:\n```dart\nListView.builder(\n  itemBuilder: (context, index) {\n    return ListTile(\n      key: ValueKey(items[index].id),\n      title: Text(items",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you use the `Positioned` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, the `Positioned` widget is used to position a child widget within a `Stack` widget. The `Positioned` widget takes four optional arguments: `left`, `top`, `right`, and `bottom`, which specify the position of the child widget relative to the edges of the parent `Stack` widget",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you write a custom RenderBox?",
    "answer_preview": "**📚 LEMON**\n\nTo create a custom `RenderBox`:\n\n1. Extend `RenderBox`\n2. Implement required methods:\n   - `performLayout()`: Calculate and set the size\n   - `paint()`: Draw the widget\n   - Optional: `hitTest()` for touch interactions\n\nUse custom `RenderBox` for:\n- Low-level rendering needs\n- Custom la",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How do you write platform-specific code in Flutter?",
    "answer_preview": "**📚 LEMON**\n\nUse `MethodChannel` for communication between Dart and native code:\n\n### Dart side:\n```dart\nconst platform = MethodChannel('com.example/channel');\n\ntry {\n  final result = await platform.invokeMethod('methodName', arguments);\n} catch (e) {\n  // Handle error\n}\n```\n\n### Native side:\n- **An",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How does Flutter handle accessibility?",
    "answer_preview": "**📚 LEMON**\n\nFlutter provides comprehensive accessibility support:\n\n### Built-in features:\n- Semantic widgets automatically expose information\n- Screen reader support (TalkBack/VoiceOver)\n- Semantic labels and hints\n- Semantic actions\n\n### Semantics widget:\n```dart\nSemantics(\n  label: 'Submit button",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by keys in flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nKeys in flutter are identifiers for widgets, elements, and semantic nodes, whereas GlobalKeys and LocalKeys are the subclasses of Key.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by keys in flutter? When one should use it",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nKeys are used in Flutter as identifiers for widgets, elements, and semantic nodes. GlobalKeys and LocalKeys are the subclasses of Key. Within the widget tree, keys are responsible for preserving the state of modified widgets. With keys, you can also reorganize and modify collecti",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by Null-aware operators?",
    "answer_preview": "**📚 GITHUB**\n**📚 INTERVIEWBIT**\n\nNull aware operator allows us to make computations based on whether or not a value is null.\n\nExample of null-aware operators are:\n\n- **Optional Chaining Operator (?.):**\n\n  We use ?. when we want to call a method/getter on an object if and only if that object is not ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by open-source software? Is Flutter open-source?",
    "answer_preview": "**📚 GITHUB**\n\nOpen-source software is software with source code that anyone can inspect, modify, and enhance. Open-source software is developed in a decentralized and collaborative way, relying on peer review and community production. Open source software is often cheaper, more flexible, and has mor",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by Streams?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nIn asynchronous programming, streams are used to provide a sequence of data in an asynchronous manner. Similar to a pipe, we put a value on one end and a listener receives it on the other. Several listeners can be put into one stream, and they'll all get the same value when they'",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by Widget testing?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nFlutter supports three types of tests:\n\n### Unit tests\n\n- Test a class or method\n- Do not check for rendering to screen, interacting with external services, or user interactions\n\n### Widget tests\n\n- Test a single widget\n- Ensure that the widget's UI looks as expected and responds",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you understand about tween animation?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nThe shortened version of in-between animation is tween animation. The start and endpoints of an animation must be specified in tween animation. Using this method, the animation can begin at the beginning and can progress through a series of values until it reaches the endpoint. T",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What does the acronym SDK stand for?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Software Development Kit** is a set of software tools and programs provided by software and hardware vendors that developers can use to develop applications for specific platforms. An SDK helps developers easily integrate their apps with a vendor's services. SDKs can include",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is `assert` used for in Dart and Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `assert` is a statement in Dart and Flutter that checks if a boolean condition is true and triggers an exception if the condition is false. It is typically used for debugging purposes, as it is intended to be used in development only and will be ignored in a production environment.",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is `Hot Reload` and `Hot Restart` in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nFlutter's `Hot Reload` feature injects the updated source code files into the running **Dart Virtual Machine (VM)**, and rebuilds the widget tree preserving the app state to quickly view the effects of the changes.\n\nWhereas `Hot Restart` loads the updated source code files into the VM ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is `pubspec.yaml` file and what does it do?",
    "answer_preview": "**📚 GITHUB**\n\nEvery Flutter project includes a `pubspec.yaml` file, which is generated while creating a new Flutter project. It's located at the top of the project tree and contains metadata about the project that the Dart and Flutter tooling needs to know.\n\nThe pubspec file specifies dependencies t",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is `TextEditingController`?",
    "answer_preview": "**📚 GITHUB**\n\nThe `TextEditingController` is a class in the Flutter framework that provides control over the text in a text field. It allows you to read and modify the text, set the selection, and listen to changes to the text.\n\nIt is typically used in conjunction with a `TextField` widget to create",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is a `Theme` in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, a `Theme` is a widget that provides a way to customize the visual appearance of an app. A `Theme` widget can be used to set the colors, fonts, and other visual properties for a specific part or the entire app.\n\nUsing a `Theme` widget, we can define a set of colors, fonts, a",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is a container class in a flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nA container class in flutter is a widget having the capacity to accommodate multiple child widgets and manage them efficiently through dimensions, padding, and background color.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is a layout in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nA **layout** in Flutter refers to how widgets are arranged on the screen. The layout is determined by the constraints passed down from the parent widget, and it determines the position and size of the child widget.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is a modal bottom sheet in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, a modal bottom sheet is a type of popup that is displayed at the bottom of the screen and covers a portion of the parent widget. Modal bottom sheets are commonly used to display additional options or information that are related to the parent widget, but require additional ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is an `AspectRatio` widget used for?",
    "answer_preview": "**📚 GITHUB**\n\nThe `AspectRatio` widget in Flutter is used to ensure that a widget maintains a specific aspect ratio, regardless of the size of the parent container. This can be useful in cases where you want a widget to have a specific shape, such as a square or a rectangle with a fixed width-to-hei",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is await in Flutter? Write its usage",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nUntil the async method is finished, await interrupts the process flow. Await generally means: Wait here until this function is finished so that you can get its return value. Await can only be used with async. Using this, all currently running functions are put on hold until the F",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is Dart and Why does Flutter use it?",
    "answer_preview": "**📚 GITHUB**\n\nDart is a programming language designed for client development, such as for the web and mobile apps. It is developed by Google and can also be used to build server and desktop applications. It is an object-oriented, class-based, garbage-collected language with C-style syntax.\n\n- Dart a",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is Dart, and why is it used in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\nDart is a client-side programming language that is used in Flutter for developing applications for multiple platforms like Android, iOS, Linux, Mac, Windows, and the web. Dart is used in Flutter because of the following reasons:\n\n- Dart is optimized for client-side development, ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is Dart?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Dart** is a general-purpose, object-oriented programming language that was initially developed by Google in 2011. It is designed to be fast, efficient, and scalable, making it ideal for building a wide range of applications, including web and mobile apps, server-side applica",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is Fat Arrow Notation in Dart?",
    "answer_preview": "**📚 GITHUB**\n\nA fat arrow (=>) is used to define a single expression in a function. This is a cleaner way to write functions with a single statement.\n\nSyntax:\n\n```\nReturnType FunctionName(Params) => Expression;\n```\n\nExample:\n\n```dart\n// Without fat arrow notation\nString findSquare(int n) {\n  return ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is Flutter Inspector?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nThe Flutter Inspector is a powerful tool used to visualize the blueprint of your widgets and their properties in Flutter.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n**📚 GITHUB**\n**📚 SIMPLILEARN**\n**📚 TURINGQUESTIONS**\n\nFlutter is an open-source, cross-platform application development framework that allows developers to create high-performance, beautiful, responsive applications for multiple platforms like Android, iOS, Linux, Mac, Windows, a",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is pubspec.yaml file?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nWhile creating a Flutter project, a particular type of file is always included at the top of the project. This file is known as the pubspec.yaml file, also called 'pubspec'. This file contains information about a project's dependencies, such as packages and their versions, typ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is State in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\nIn Flutter, state refers to the data or information that can change dynamically during the lifetime of a widget. Widgets are the building blocks of a Flutter app, and they can be either stateful or stateless.\n\n- Stateful widgets maintain state information and can update their st",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is state management?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nWhether you are building a mobile app or a web application, State Management is crucial. Using it, states of various UI controls are centralized to handle data flow across an application. It can be a text field, radio button, checkbox, dropdown, toggle, form, and so on.\n\nIn Flutt",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the App state?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nApp State is a shared state or application state. App states can be shared across sections of your app and maintain user sessions in the same way.\n\n### App state includes activities such as:\n\n- Login info\n- User preferences\n- E-commerce shopping cart\n- Social networking notificati",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the Dart programming language?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nDart is an object-oriented programming language with a syntax like the C Language. The language is open source and was developed by Google in 2011. The language was conceptualized to code the mobile app frontend. The app is used for coding frontend user interfaces. Flutter apps ma",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the Dart programming language? Explain in detail",
    "answer_preview": "**📚 SIMPLILEARN**\n\nYour preparation for the flutter interview questions is incomplete, if you don't know about the dart programming language. Because, flutter doesn't exist without Dart Programming language. Dart programming language is object-oriented, open source, and quite similar to the syntax o",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between `Container` and `SizedBox` widget?",
    "answer_preview": "**📚 GITHUB**\n\n**SizedBox** is a widget for giving some constant height or width between two widgets. It does not contain any decorative properties just like color, shape, borderRadius etc.\n\nOn the other hand **Container** is a widget that any person can modify according to their needs.\n\nWhen used fo",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between `main()` and `runApp()` functions in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `main()` function tells Dart where the program starts, and it must be in the file that is considered the \"entry point\" for the program. By convention, this will be in a file called `main.dart`. This main function can execute any code within it's code block.\n\nThe `runApp()` function",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between Cupertino and Material Design in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nCupertino and Material Design are two design languages used in Flutter for building iOS and Android apps, respectively. While both design languages follow different design principles and have unique features, they share some similarities as well.\n\nHere are some of the main differences ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between mainAxisSize.min and mainAxisSize.max?",
    "answer_preview": "**📚 LEMON**\n\n### mainAxisSize.min:\n- Widget wraps its content\n- Takes only the space needed by children\n- Shrinks to fit\n\n### mainAxisSize.max:\n- Widget expands to fill available space along main axis\n- Takes all available space from parent\n\n```dart\n// min - wraps content\nColumn(\n  mainAxisSize: Mai",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between MaterialApp and WidgetsApp in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\n| MaterialApp | WidgetsApp |\n|-------------|------------|\n| Used for creating applications that follow the Material Design guidelines | Used for creating applications that do not follow the Material Design guidelines |\n| Provides pre-built widgets like AppBar, BottomNavigationBa",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between Navigator and Router in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\n| Navigator | Router |\n|-----------|--------|\n| Widget used to manage the navigation stack | More flexible and powerful way of managing navigation |\n| Allows back and forth navigation using back button or gestures | Allows custom transition animations and complex navigation flow",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between padding and margin in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, `padding` and `margin` are two properties used to adjust the spacing between widgets in the layout.\n\n- Padding is the amount of space added within a widget, between its content and its border. It affects the layout of the widget and increases the size of the widget. Padding",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between SizedBox and Container?",
    "answer_preview": "**📚 SIMPLILEARN**\n\n### SizedBox\n\n- The SizedBox widget in Flutter has a specified size\n- In SizedBox, we cannot set the color or decoration for the widget\n- We can only use it with a child widget having a specific width or height\n\n### Container\n\n- The Container in Flutter is a parent widget containi",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between StatelessWidget and StatefulWidget in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\nIn Flutter, StatelessWidget and StatefulWidget are two different types of widgets that are used to create UI elements.\n\n| StatelessWidget | StatefulWidget |\n|-----------------|----------------|\n| StatelessWidget is a widget that does not have any mutable state | StatefulWidget i",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the Flutter architecture?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nFlutter has a three-layered architecture:\n\n1. **Upper Layer**: The upper layer consists of the Dart programming language along with the widgets, animations, illustrations, customizations, etc.\n2. **The middle layer or the Flutter Engine**: This layer deals with text display, forma",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of `SafeArea` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `SafeArea` widget insets its child by sufficient padding to avoid intrusions by the operating system. For example, this will indent the child by enough to avoid the status bar at the top of the screen. It will also indent the child by the amount necessary to avoid the Notch, or sim",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of a key in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\nIn Flutter, a **Key** is an object that identifies a widget. It is used to maintain the state of the widget and to optimize the rendering performance of the app.\n\nWhen a widget is built, Flutter assigns a unique identity to it based on its location in the widget tree. However, w",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of animation controller class in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **Animation Controller** class in Flutter is used to control and manage animations. It provides a way to start, stop, or pause an animation, and allows you to define the duration, speed, and direction of an animation.\n\nThe primary purpose of the Animation Controller class ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of setState() in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\n`setState()` is a method that is used to update the state of a Stateful widget in Flutter. When a widget is updated, the Flutter framework calls the `build()` method of the widget to rebuild its UI based on the new state.\n\n### How setState() works:\n\n1. The `setState()` method te",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `dispose()` method in a StatefulWidget?",
    "answer_preview": "**📚 GITHUB**\n\nThe `dispose()` method is a lifecycle method in the `State` class of a `StatefulWidget` in the Flutter framework. It is called when the stateful widget is removed from the widget tree, giving us the opportunity to perform any cleanup tasks or release any resources that the widget may h",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `FittedBox` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `FittedBox` widget in Flutter is used to automatically scale and position its child within its own bounds. The purpose of the `FittedBox` widget is to provide an easy-to-use way to adjust the size and position of a child widget to fit within its parent widget. When using the `Fitte",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `initState()` method in a StatefulWidget?",
    "answer_preview": "**📚 GITHUB**\n\nThe `initState()` method is a lifecycle method in the `StatefulWidget` class of the Flutter framework. It is called once when the stateful widget is first inserted into the widget tree and it is used to initialize the state of the widget.\n\nIn the `initState()` method, we can perform on",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `Navigator` class in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, the `Navigator` class is used to manage a stack of pages or routes in an app. It provides methods to push and pop routes onto and off of the stack, allowing the user to navigate between different screens or views within the app.\n\nHere are some of the key features and use ca",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `SingleChildScrollView` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `SingleChildScrollView` widget in Flutter is used to make its child widget scrollable if it overflows the parent container.\n\nThe purpose of `SingleChildScrollView` is to provide a way to display content that is larger than the available space. This widget is often used when a widge",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `Stack` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, the `Stack` widget is used to place widgets on top of each other in a specific order. It allows to position widgets at specific locations within the parent widget by using offsets or alignment.\n\nThe main purpose of the `Stack` widget is to provide a way to overlay widgets o",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `Visibility` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, the `Visibility` widget is used to control the visibility of a child widget based on a certain condition. The `Visibility` widget can be used to show or hide a widget dynamically, based on user interactions or other conditions.\n\nThe `Visibility` widget has a visible propert",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the Expanded widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, the `Expanded` widget is used to adjust the available space for a child widget of a `Row`, `Column`, or `Flex` widget, by dividing the remaining free space among the children.\n\nWhen an `Expanded` widget is used, the child widget of the Row, Column, or Flex takes up as much ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the Material Design Icons package in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe Material Design Icons package in Flutter provides a set of icons that follow the Material Design guidelines for iconography. These icons are designed to be simple, easy to recognize, and scalable, making them ideal for use in mobile apps and web applications.\n\nThe Material Design I",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the scaffold widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `Scaffold` widget in Flutter is a basic structure or layout for a screen or a page in a Flutter application. It provides a visual structure for displaying a material design-style layout, which includes app bars, drawers, floating action buttons, and more.\n\nThe Scaffold widget serve",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the use of Mixins?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nMultiple inheritances are not supported by Dart. Thus, we need mixins to implement multiple inheritances in Flutter/Dart. The use of mixins makes it easy to write reusable class code in multiple class hierarchy levels. Mixins can also be used to provide some utility functions (su",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the use of the Await function?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **Await** function is an asynchronous function. Its job is to wait until it gets the final value. Await is used with async functions and that run asynchronously, giving users the choice to wait for the asynchronous mode to finish before continuing.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the use of Ticker in Flutter?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nWe use a ticker to tell how often our animation is refreshed in Flutter. Signals are sent at a constant frequency, such as 60 times per second, using this type of signal-sending class. We understand it better with our watch, which ticks constantly. For each tick, a callback metho",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is the widget lifecycle of a StatefulWidget?",
    "answer_preview": "**📚 LEMON**\n\nThe lifecycle stages are:\n\n1. **createState()** - Creates the mutable state object\n2. **initState()** - Called once when state is created\n3. **didChangeDependencies()** - Called when dependencies change\n4. **build()** - Called to build the widget tree (called frequently)\n5. **didUpdateW",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What is used to import packages for your project?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**pubspec.yaml** file is used to import packages in the Dart code. It allows us to set the constraints for the application. This file contains project dependencies, general project settings, and project assets.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What process will you use to reduce widget rebuild?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nOn rebuilding, the state of the widget changes. This, however, helps the user to see the UI reflect state changes. At this point recreating sections of the user interface that do not need to be changed is unnecessary.\n\nTo avoid the needless rebuilding of the widgets one can di",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What technology is Flutter built with?",
    "answer_preview": "**📚 GITHUB**\n\nFlutter is an open-source UI software development toolkit created by Google for building natively compiled applications across mobile, web, and desktop from a single codebase. It's primarily developed using the Dart programming language, also by Google, which supports ahead-of-time (AO",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What was the first version of Flutter which ran on an Android operating system?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Sky** is the first version of Flutter which ran on Android OS. It was announced at the 2015 Dart developer summit with the stated goal of being able to render consistently at 120 frames per second.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the core of the Flutter layout mechanism?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe main core of the Flutter layout mechanism is the **Widgets**. The widgets are the building blocks of the user interface, and they are arranged in a tree-like structure known as the widget tree. The image, text, icon, and even the layout of your application are all widgets.",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the difference between Provider, Riverpod, and Bloc?",
    "answer_preview": "**📚 LEMON**\n\n- **Provider:** A wrapper around `InheritedWidget` for dependency injection and state management. Simple to use and integrates well with Flutter's widget tree.\n\n- **Riverpod:** A safer, more testable evolution of Provider. It doesn't depend on `BuildContext` and offers compile-time safe",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the function of the future in Dart?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nA **future** function is used to predict a potential error or value that may occur in the future. It can be completed with a value or an error. Here, developers can plug callbacks for each case. Some programming languages use \"promise\" for the same function.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the latest version of Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**3.7** is the latest version of Flutter (as of the time of writing). Along with an improved framework, this new version also has great new features like enhanced material 3 support, cascading menus and menu bars, impeller preview, custom context menus, and DevTools updates am",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the name of a constructor for a class in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe name of a constructor for a class is **the same as that of the class itself**. Constructor is a special strategy that is used to create objects with predetermined values for the properties. There are three types of constructors in Flutter: named constructor, standard const",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the purpose of GlobalKey, and what are its downsides?",
    "answer_preview": "**📚 LEMON**\n\n`GlobalKey` allows access to a widget's state from anywhere in the widget tree.\n\n### Uses:\n- Access state across different parts of the tree\n- Call methods on a widget's state\n- Maintain state when moving widgets\n- Form validation across complex UIs\n\n### Downsides:\n- Potential memory le",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the role of BuildContext in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nIn Flutter, the **BuildContext** is an object that provides access to the location of a widget in the widget tree hierarchy and to various services such as Theme, MediaQuery, and Navigator. The BuildContext is used by widgets to access the properties of their parent widget, su",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the role of image.network() constructor in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **Image.network()** constructor is a widget in Flutter that allows you to display images from the network in your application. It is used to load and display images from a URL.\n\n**Example:**\n```dart\nImage.network('https://picsum.photos/250?image=9')\n```\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the role of RepaintBoundary?",
    "answer_preview": "**📚 LEMON**\n\n`RepaintBoundary` prevents unnecessary repaints by isolating parts of the widget tree. When a `RepaintBoundary` is used:\n\n- Flutter creates a separate layer for that subtree\n- Changes inside don't trigger repaints outside\n- Changes outside don't trigger repaints inside\n\n### Benefits:\n- ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What's the use of Navigation.push in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe role of **Navigation.push** in Flutter is to add a route to a bundle of other routes which are managed by the navigator.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "When should you use mainAxisAlignment and crossAxisAlignment?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nThe crossAxisAlignment and mainAxisAlignment are used to control how a row and column widget aligns with their children depending on our choice.\n\n### mainAxisAlignment\n\nIn mainAxisAlignment, the rows will run horizontally whereas the columns will run vertically.\n\n### crossAxisAlig",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "When to use mainAxisAlignment and crossAxisAlignment",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nThe mainAxisAlignment is how items are aligned on that axis, whereas crossAxisAlignment is how items are aligned on the other axis. Row and column widgets can align their children according to our preferences using the crossAxisAlignment and the mainAxisAlignment properties.\n\n###",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "When was the first version of Flutter released?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe first version of Flutter was released in **May 2017**, but it was first announced in 2015. In December 2018, Google released Flutter 1.0. In December 2019, Flutter 1.12 was released.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Which folder is used to write Android apps in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Android Folder** is used to write Android apps in Flutter. The Android Folder contains files and folders required for running the application, and these files are autogenerated during the creation of a Flutter project.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Which one is better, either flutter or react native?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nToday, thousands of mobile apps are being built with the two most popular cross-platform development frameworks i.e., React Native and Flutter. There are many similarities between React Native and Flutter including reloading quickly, excellent UI, awesome tooling, and capability ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Which operator is used to evaluate and return values between two expressions?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **`??` operator** is used to evaluate and return values between two expressions. This operator first checks the expression 1 and, if it is non-null, returns its value; otherwise, it will evaluate and return the value of expression 2.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Which widget allows us to refresh the screen?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**RefreshIndicator Widget** enables us to refresh the screen. When the user pulls down on the widget, the onRefresh callback is triggered, which typically involves fetching new data from a server or updating the UI in some way.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Which widget can be used to display one after another in scroll format?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **ListView Widget** is used to display a large number of items as a scrollable list. ListView is an advanced version of the Column widget that automatically provides scrolling when the list of items won't fit on the screen.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Which widget in Flutter is a box that comes with a different size?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**SizedBox** is a widget in Flutter that allows us to specify an arbitrary size for a widget. It is basically used to add empty space between widgets. SizedBox also supports specifying a specific aspect ratio for its child.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Why do we use a ticker in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Tickers** are used in Flutter as they provide a secure way of updating the UI at 60 frames per second. It is a class that listens to the frameCallback and calls a tick function that forwards the elapsed duration between the current frame and last frame to the ticker listener",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Why do we use const keyword in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nWe use the **const** keyword to declare constants. Basically, when we know the value of a variable at compile time. This means the compiler knows in advance what value to store.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Why does a flutter app usually take a long developing time?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nThe first time you build a Flutter application, it takes much longer than usual since Flutter creates a device-specific IPA or APK file. Xcode and Gradle are used in this process to build a file, which usually takes a lot of time.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Why does it generally take a long time to develop a Flutter app?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nBecause Flutter generates a device-specific IPA or APK file, building a Flutter application takes substantially longer the first time. This method, which normally takes a long time, uses Xcode and Gradle to build a file.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Why HTTP package is used in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**HTTP package** is used in Flutter for making HTTP requests to web servers. It allows Flutter developers to send HTTP requests and receive HTTP responses from APIs or web servers. Flutter apps need to communicate with APIs or web servers to fetch data or send data to the serv",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Why is Flutter preferred over other mobile app developing tools?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter is a free and open-source mobile UI framework, introduced by Google in May 2017. Flutter enables you to develop a native mobile app using only one codebase. This implies you may design two separate apps using the same programming language and codebase (for iOS and Andr",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Write difference between Hot reload and Hot restart",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nFor any dart application, the initial execution requires a fair amount of time. Therefore, to solve this problem, flutter has two features: Hot Reload and Hot Restart, which reduce the execution time of our app after we run it.\n\n| Hot Reload | Hot Restart |\n|------------|--------",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Write the advantages of using flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nFor developing mobile applications, Flutter usually fulfills the custom needs and requirements. It offers the following advantages:\n\n- **Reduce Code Development**: Flutter's hot reload feature allows it to offer faster performance. With it, the application gets compiled using the",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Write the difference between runApp() and main() in flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\n- **main()**: This function starts the program. Flutter does not allow us to write any program without the main() function\n- **runApp()**: Using runApp(), you are able to return the widgets that are connected to the screen as a root of the widget tree that will be rendered on the",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Write the difference between SizedBox Vs Container",
    "answer_preview": "**📚 INTERVIEWBIT**\n\n| Container | SizedBox |\n|-----------|----------|\n| Multiple child widgets can be controlled by adjusting size, padding, and color | Specific size box with limited functionality |\n| Allows setting widget's color or decoration | Does not allow setting color or decoration |\n| Used ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Write the limitations of flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nFlutter has the following limitations:\n\n- **Third-party libraries are limited**: Since Flutter is relatively new, the number of third-party libraries is small. Additionally, some widgets in Flutter are only available on one platform\n- **Release size is larger**: Developers get fr",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How does Flutter's rendering pipeline work?",
    "answer_preview": "**📚 LEMON**\n\nFlutter's rendering follows a three-tree architecture:\n\n**Widget → Element → RenderObject**\n\n### Phases:\n- **Build phase:** Creates/updates the widget tree\n- **Layout phase:** Determines size and position of each RenderObject\n- **Paint phase:** Draws each RenderObject to layers\n- **Comp",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How does Flutter's widget tree differ from element and render trees?",
    "answer_preview": "**📚 LEMON**\n\nFlutter uses three trees:\n\n### Widget tree:\n- Immutable configuration\n- Describes the UI structure\n- Lightweight\n- Rebuilt frequently\n\n### Element tree:\n- Manages widget lifecycle and state\n- Mutable\n- Links widgets to render objects\n- Persists across builds\n- Handles widget updates eff",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How does InheritedWidget work, and when would you create one?",
    "answer_preview": "**📚 LEMON**\n\n`InheritedWidget` propagates immutable data down the widget tree efficiently. It allows descendant widgets to access data without explicitly passing it through constructors.\n\n### Use cases:\n- Sharing themes across the app\n- Providing localization data\n- Sharing app-wide configuration\n- ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How does setState() differ from ValueNotifier and ChangeNotifier?",
    "answer_preview": "**📚 LEMON**\n\n### setState():\n- Scoped to a single `StatefulWidget`\n- Triggers rebuild of that widget only\n- Simple and straightforward\n- Best for local, widget-specific state\n\n### ValueNotifier:\n- Holds a single value\n- Notifies listeners when value changes\n- Can be used across multiple widgets\n- Li",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you architect a plugin that uses platform channels?",
    "answer_preview": "**📚 LEMON**\n\nStructure for a robust plugin:\n\n1. **Create a MethodChannel** in Dart\n2. **Define a clear contract** for native methods\n3. **Implement platform-specific code:**\n   - Android: Kotlin/Java\n   - iOS: Swift/Objective-C\n4. **Handle result parsing** in Dart\n5. **Add error handling** for platf",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you debounce a TextField input?",
    "answer_preview": "**📚 LEMON**\n\nTwo common approaches:\n\n### Using Timer:\n```dart\nTimer? _debounce;\n\nvoid onSearchChanged(String query) {\n  if (_debounce?.isActive ?? false) _debounce!.cancel();\n  _debounce = Timer(const Duration(milliseconds: 500), () {\n    // Perform search\n  });\n}\n\n@override\nvoid dispose() {\n  _debo",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you execute code only in debug mode?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nWe first need to import the dart foundation in order to run the code only in debug mode:\n\n```dart\nimport 'package:flutter/foundation.dart' as Foundation;\n```\n\nThe next step is to use `kReleaseMode` as follows:\n\n```dart\nif (Foundation.kReleaseMode) {  // is Release Mode??\n  print(",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you implement dynamic theming?",
    "answer_preview": "**📚 LEMON**\n\nImplement theme switching with state management:\n\n```dart\nclass ThemeProvider extends ChangeNotifier {\n  ThemeMode _themeMode = ThemeMode.light;\n  \n  ThemeMode get themeMode => _themeMode;\n  \n  void toggleTheme() {\n    _themeMode = _themeMode == ThemeMode.light \n      ? ThemeMode.dark \n",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you make HTTP requests in the Flutter framework?",
    "answer_preview": "**📚 GITHUB**\n\nMaking HTTP requests in Flutter can be done using the `http` package. This package provides a simple API for sending HTTP requests and receiving HTTP responses.\n\nHere is an example of how to make a GET request to retrieve data from an API:\n\n```dart\nimport 'dart:convert';\nimport 'packag",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you optimize build performance in a complex widget tree?",
    "answer_preview": "**📚 LEMON**\n\nOptimization strategies:\n\n- **Use const constructors** - Allows widget reuse and prevents unnecessary rebuilds\n- **Use RepaintBoundary** - Isolates parts of the tree from repainting\n- **Use ValueListenableBuilder** - Rebuilds only the listening widget, not the entire tree\n- **Isolate re",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you profile and analyze a Flutter app's performance?",
    "answer_preview": "**📚 LEMON**\n\nMultiple tools and techniques:\n\n### Flutter DevTools:\n- Performance tab for frame rendering analysis\n- Timeline view for detailed profiling\n- Memory tab for memory leaks\n\n### Command line:\n- Run with `flutter run --profile` (optimized but debuggable)\n- Use `flutter run --release` for fi",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you securely store tokens on a device?",
    "answer_preview": "**📚 LEMON**\n\nUse `flutter_secure_storage` package, which leverages:\n- **Android:** Android Keystore for encrypted storage\n- **iOS:** iOS Keychain for secure storage\n\n```dart\nfinal storage = FlutterSecureStorage();\n\n// Write\nawait storage.write(key: 'token', value: 'your_secure_token');\n\n// Read\nStri",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "How would you write a performant infinite scroll list?",
    "answer_preview": "**📚 LEMON**\n\nImplement using these strategies:\n\n1. **Use ListView.builder()** - Creates items lazily\n2. **Implement ScrollController** - Detect when user reaches bottom\n3. **Load items in batches** - Don't load all data at once\n4. **Cache loaded items** - Prevent reloading same data\n5. **Add loading",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "In What technology is Flutter built?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nFlutter is built using:\n\n- C\n- C++\n- Skia - 2D rendering engine\n- Dart - object-oriented language\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Is Dart language necessary for Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nIt is compulsory to know the Dart language to use Flutter. Flutter applications make use of the Dart language for coding mobile phone apps.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Is Flutter a front-end framework or back-end?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter is primarily a **front-end framework**. It provides tools and widgets to build beautiful and engaging user interfaces, and it supports various platforms such as iOS, Android, and the web. However, the framework does provide some back-end functionalities. Flutter applic",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Is Flutter free?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Yes.** It is a free and open source mobile UI framework created by Google. Here, with only one codebase, you can create native mobile applications.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Is Flutter Open Source or not?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nYes, Flutter is a free and open-source UI software development kit from Google that allows developers to build cross-platform mobile apps with ease.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "List some important features of flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nAmong the main features of flutter for developing mobile frameworks are:\n\n- **Flexibility, scalability, and integration**: Flutter's easy-to-use and easy-to-integrate framework provides enhanced flexibility, scalability, and integration capabilities\n- **Hot Reload**: If the devel",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Name some apps that mostly use flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nFlutter is used today by many organizations for developing apps. The following are some of the most popular apps built on Flutter:\n\n- Google Ads\n- Reflectly\n- Alibaba\n- Birch Finance\n- Coach Yourself\n- Tencent\n- Watermaniac, etc.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Name some best editors for flutter development",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nWith the Flutter development tools, developers can make Flutter development faster and thus boost their productivity. Here are some popular IDEs for Flutter development:\n\n- Android Studio\n- Visual Studio\n- IntelliJ IDEA\n- Xcode\n- Eclipse\n- Emacs\n- Vim, etc.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Name some popular apps made with Flutter.",
    "answer_preview": "**📚 GITHUB**\n\n- BMW\n- Google Pay\n- Alibaba\n- Beika\n- Dream11\n- eBay\n- Nubank\n- Reflectly\n- Rive\n- Toyota\n- Tencent\n- Hamilton\n- iRobot\n\n_Source: [Flutter Showcase](https://flutter.dev/showcase)_\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Name some popular apps that use Flutter.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nSome of the most popular apps that employ Flutter include:\n\n- Google Ads\n- Hamilton\n- KlasterMe\n- Reflectly\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Name the different types of build modes in Flutter.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThere are three types of build modes in Flutter:\n\n**Debug** - It is used to test the apps. On Android Studio, you can find a green play button on the top panel.\n```bash\nflutter run\n```\n\n**Profile** - In this mode, some debugging ability is maintained - enough to profile your a",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Name two database packages mostly used in Flutter",
    "answer_preview": "**📚 INTERVIEWBIT**\n\n### Firebase database\n\nGives users access to and control over the cloud database. Firebase basically provides a NoSQL database for Flutter apps with the ability to manage data retrieval and storage through JSON protocol. Data sync and quick loading make it one of the most suitabl",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Suppose you have to represent real world behavior in Flutter, which animation would you use?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe choice of animation in Flutter would depend on the specific behavior that needs to be represented. Flutter provides several animation options that can be used to represent real-world behavior. These include:\n\n- Physics-based animation\n- Tween animation\n- Curved animation\n-",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "The most useful editors for Flutter apps",
    "answer_preview": "**📚 SIMPLILEARN**\n\nThe most useful editors for Flutter apps are:\n\n- Visual Studio\n- Android Studio\n- Xcode\n- IntelliJ IDEA\n- Eclipse\n- Vim\n- Emacs\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Uses of keys in Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nKeys in flutter are used primarily to:\n\n- Preserve the state of modified widgets in the widget trees\n- Reorganize and modify the collections of widgets having equivalent types and defined states\n- It does not modify a tree that consists of only stateless widgets\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are different build modes in flutter?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nDepending on your development phase, the framework compiles your code in different ways or modes, which we called a build mode. Flutter's tooling allows the application to be compiled in three modes:\n\n- **Debug Mode**: This mode enables debugging of apps on a physical device, emu",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are different types of Streams?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nThe streams' functionality is part of Dart and is inherited by Flutter. In Flutter, there are two kinds of streams:\n\n### Single Subscription Streams\n\n- Deliver events sequentially\n- Considered as sequences contained within a larger whole\n- Used when the order in which events are ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are isolates in Dart and when should they be used?",
    "answer_preview": "**📚 LEMON**\n\nIsolates are parallel computing units in Dart that run code without sharing memory. Each isolate has its own memory heap and event loop.\n\n### Use isolates for:\n- CPU-intensive tasks (parsing large JSON, image processing)\n- Long-running computations\n- Preventing UI blocking\n- Complex mat",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are keys and how do you use them?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nA set of IDs for Widgets, Elements and SemanticsNodes make up the key class. Keys are responsible for preserving the state of widgets when they are updated inside the widget tree. Keys may also be used to modify and rearrange collections of widgets of the same type and defined",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are keys used for in animations?",
    "answer_preview": "**📚 LEMON**\n\nKeys preserve widget identity across frames in animations:\n\n### Purpose:\n- Help Flutter track widgets during animation\n- Preserve state when widgets move\n- Ensure smooth transitions\n- Prevent widget confusion in lists\n\n### Types:\n- `ValueKey` - Based on a value\n- `ObjectKey` - Based on ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are packages and plugins in Flutter?",
    "answer_preview": "**📚 GITHUB**\n**📚 SIMPLILEARN**\n**📚 TURINGQUESTIONS**\n\nSimilar types of classes, interfaces, and sub-packages are known as packages in Flutter or any other object-oriented language. The packages and plugins are used in development to reduce the coder's effort. The coder need not write the code for ev",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are some common Flutter performance optimization techniques?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\nFlutter provides many tools and techniques for optimizing the performance of your application:\n\n- **Minimizing widget rebuilds**: Use the `const` and `final` keywords for widgets that don't change\n- **Reducing the size of widgets**: Use SizedBox to create empty space and Spacer ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are some operators commonly used in Dart?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nHere are some of the operators that are commonly used to build apps in Dart:\n\n- **`=`** (assignment operator): Used to assign a value to a variable.\n- **`??`** (null-aware operator): Used to check whether a variable is null or not and provide a default value if it is null.\n- *",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are some ways to handle dependency injection in Flutter?",
    "answer_preview": "**📚 LEMON**\n\nSeveral approaches:\n\n### Provider:\n- Most popular\n- Integrates with widget tree\n- Simple and intuitive\n\n### get_it:\n- Service locator pattern\n- Independent of widget tree\n- Great for services and repositories\n\n### Riverpod:\n- Evolution of Provider\n- Compile-time safety\n- No BuildContext",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the advantages of using Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nFlutter has various advantages to coding mobile apps:\n\n- **Reduce the amount of code**: Hot reload feature provided by Flutter helps in faster performance. The app is coded in C/C++ code to make it as close to machine code as possible for faster app development. The widget availab",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the different types of streams in Dart?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nStreams provide an asynchronous sequence of data. Asynchronous programming uses the idea of streams. They refer to a program's asynchronous succession of data occurrences. We put a value on one end and a listener on the other, similar to a pipe. Several listeners can be combin",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the different types of widgets in Flutter?",
    "answer_preview": "**📚 GEEKSFORGEEKS**\n\nIn Flutter, widgets are the building blocks for creating UI elements. There are two types of widgets in Flutter:\n\n**Stateless widgets:** These widgets are immutable, meaning they cannot be changed once they are created. Stateless Widget are used when the UI elements do not need ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the limitations of Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n**📚 TURINGQUESTIONS**\n\nSince Flutter is still a relatively new tool, it has some limitations. They are as follows:\n\n- The number of third-party libraries is very small\n- The release size of Flutter is larger than expected\n- Flutter requires to be used along with another OOP languag",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the most useful editors for Flutter apps?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nFlutter tools make use of plugins to code mobile phone apps. The plugins can help in Dart code compilation, analysis of the code, and development of apps.\n\n### Some used Flutter tools for IDE development are:\n\n- Visual Studio\n- Android Studio\n- Xcode\n- IntelliJ IDEA\n- Eclipse\n- Em",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the popular apps which make use of Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nSome of the most popular apps using Flutter are:\n\n- Reflectly\n- Google Ads\n- Alibaba\n- Tencent\n- Birch Finance\n- Coach Yourself\n- Watermaniac\n\nIn general, Flutter is used to develop android, iOS, Linux, Mac, and Web applications from a single codebase or with high brand designs.\n\n",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the resources to learn Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nYou can learn flutter from Flutter Documentation available as open source on Google.\n\n---",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the risks of using BuildContext after await?",
    "answer_preview": "**📚 LEMON**\n\nAfter an `await`, the widget might be disposed, leading to:\n\n### Risks:\n- Widget no longer mounted\n- BuildContext invalid\n- Runtime errors when using context\n- Unexpected behavior\n\n### Solutions:\n\n**1. Check if mounted:**\n```dart\nFuture<void> loadData() async {\n  final data = await fetc",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are the types of widgets present in flutter?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nIn flutter, widgets can be divided into two categories:\n\n- **Stateless Widget**: A widget that does nothing is a Stateless Widget. In essence, they are static and don't store any state. Thus, they don't save values that may change\n- **Stateful Widget**: A widget that does anythin",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What are widgets in Flutter?",
    "answer_preview": "**📚 GITHUB**\n**📚 SIMPLILEARN**\n\nFlutter apps make use of widgets to code mobile phone applications. You will almost exclusively build on Flutter using widgets. Widgets define the view of the app. When you change the code, the widget code is automatically adjusted. Widgets are nested with each other ",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What build modes are available in Flutter?",
    "answer_preview": "**📚 SIMPLILEARN**\n\nFlutter is made up of three build modes:\n\n- **Debug Mode**: This mode is for debugging apps on a device or a simulator\n- **Profile Mode**: Some debugging abilities are available, along with an analysis of app's performance in testing rounds\n- **Release Mode**: This mode is used wh",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by Dart? Write its importance",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nDart, a programming language developed by Google, is used to code Flutter apps as well as server and desktop applications. By using Dart, Flutter avoids the use of a separate declarative layout language such as JSX or XML.\n\nA simple Dart program:\n\n```dart\nvoid main() {\n  for (int",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by flutter SDK?",
    "answer_preview": "**📚 INTERVIEWBIT**\n\nA Flutter SDK (Software Development Kit) enables developers to build applications for mobile, web, and desktop using a single codebase.\n\n### Flutter SDK includes:\n\n- Dart SDK\n- Rendering engine, widgets, APIs for testing and integration\n- Compilation tools for Native Machine Code",
    "source": "BASICS",
    "difficulty": "basic"
  },
  {
    "question": "Can you communicate between isolates? Describe an Isolate?",
    "answer_preview": "**📚 GITHUB**\n\nYes, you can communicate between isolates in Dart using message passing via `SendPort` and `ReceivePort`. Isolates do not share memory, and each isolate has its own memory space and event loop. To communicate, one isolate sends messages to another through a `SendPort`, and the receivin",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe how to implement internationalization in a flutter app?",
    "answer_preview": "**📚 GITHUB**\n\nTo implement internationalization (i18n) in a Flutter app:\n\n- Include the `flutter_localizations` package in the `pubspec.yaml` file.\n- Set the `localizationsDelegates` and `supportedLocales` properties in the MaterialApp.\n- Use .arb files to store translations for different locales (e",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe how to use Flutter's gesture recognition system to detect user input?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter's gesture recognition system provides a set of pre-defined gestures, such as tap, drag, and scale, that allow you to detect user input and react to it. You can use the **GestureDetector** widget to listen for gestures and the `GestureDetector.onTap` method to handle ta",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe how to use the Flutter animations API to create custom animations?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe Flutter animations API provides a set of classes and widgets that allow you to create custom animations, such as tween animations or physics-based animations. You can use the **AnimationController** class to manage the animation's state, and the **Tween** class to define t",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe in detail the Flutter IDEs?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nSome of the most popular Flutter IDEs include the following:\n\n### IntelliJ IDEA\n**IntelliJ IDEA** is feature-rich, boasts extensive support for many languages, and provides smart coding assistance. Most beginner developers would probably get by with the free Community Edition,",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Can you explain how to use Flutter's built-in navigation system to create a multi-level navigation hierarchy?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter's navigation system allows you to create a multi-level navigation hierarchy by using the **Navigator** widget to manage a stack of pages. You can push new pages onto the stack using the `Navigator.push` method and remove them using the `Navigator.pop` method.\n\n```dart\n",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Can you explain the process of testing a Flutter app?",
    "answer_preview": "**📚 GITHUB**\n\nThe process of testing a Flutter app involves writing and running different types of tests to verify the behavior and functionality of the app. There are two main types of tests in Flutter: unit tests and integration tests. Unit tests focus on individual pieces of code, such as a singl",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Explain how you will deploy a Flutter app to the Google Play/App Store?",
    "answer_preview": "**📚 GITHUB**\n\nTo deploy a Flutter app to the Google Play Store or App Store, follow these steps while adhering to their respective guidelines on content, user privacy, and design:\n\n**Deploying to Google Play Store:**\n- Google Play Developer Account: Create an account and set it up.\n- Generate a Sign",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Flutter Vs React: Which is better?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nIt's difficult to decide which framework to choose as they both are exceptionally good and loved by companies and developers. However, you can pick one based on your particular needs.\n\n### Flutter Advantages:\n- Single codebase for iOS, Android, Web, Desktop\n- Hot reload for fa",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a custom animation curve in flutter?",
    "answer_preview": "**📚 GITHUB**\n**📚 TURINGQUESTIONS**\n\nTo implement a custom animation curve in Flutter, you can create a class that extends the **Curve** class and provide a custom implementation of the `transform` method.\n\n**Example: Create a bounce-in curve:**\n\n```dart\nclass BounceInCurve extends Curve {\n  @overrid",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a custom transition between screens in flutter?",
    "answer_preview": "**📚 GITHUB**\n**📚 TURINGQUESTIONS**\n\nTo implement a custom transition between screens, you can use the **PageRouteBuilder** class and provide a custom `transitionsBuilder` function.\n\n**For example, to create a fade transition:**\n\n```dart\nclass FadeRoute extends PageRouteBuilder {\n  final Widget page;",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a draggable widget in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nTo implement a draggable widget in Flutter, you can use the **Draggable** and **DragTarget** widgets.\n\n**Example: Create a draggable widget that can be dropped onto a specific target:**\n\n```dart\nclass DraggableExample extends StatefulWidget {\n  @override\n  _DraggableExampleSta",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "How do you work with multiple Flutter flavors?",
    "answer_preview": "**📚 GITHUB**\n\nTo work with multiple Flutter flavors, follow these steps:\n\n- Define flavors in android/app/build.gradle, add `productFlavors` like dev, staging, and prod with unique `applicationId`s.\n- Set up iOS schemes, create new schemes and configuration files in Xcode for each flavor.\n- Use Dart",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "How would you create a custom widget in Flutter, and what are the benefits of doing so?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nTo create a custom widget in Flutter, you need to create a new class that extends either **StatefulWidget** or **StatelessWidget**, depending on whether your widget needs to be stateful or not.\n\n### Benefits of creating custom widgets:\n\n1. **Reusability**: Use the same widget ",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "List the responsibilities of `FlutterActivity`.",
    "answer_preview": "**📚 GITHUB**\n\n`FlutterActivity` is the simplest and most direct way to integrate Flutter within an Android app.\n\n`FlutterActivity` maintains the following responsibilities:\n\n- Displays an Android launch screen.\n- Configures the status bar appearance.\n- Chooses the Dart execution app bundle path, ent",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What are `Slivers`?",
    "answer_preview": "**📚 GITHUB**\n\nA sliver is a portion of a scrollable area that you can define to behave in a special way. You can use slivers to achieve custom scrolling effects, such as elastic scrolling.\n\nUnder the hood, slivers are used to implement all of the scrollable views you use, including ListView and Grid",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What are platform channels in Flutter and when would you use them?",
    "answer_preview": "**📚 GITHUB**\n\nPlatform channels in Flutter enable communication between Flutter's Dart code and the host platform's native code (e.g., Java/Kotlin on Android or Swift/Objective-C on iOS). They are used when you need to access platform-specific APIs or features not directly available in Flutter.\n\nWhe",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What are the advantages of a Flutter Inspector?",
    "answer_preview": "**📚 GITHUB**\n\nThe Flutter Inspector provides several key features that help developers debug and optimize their applications:\n\n1. **Select Widget Mode:** Allows you to choose a widget directly from the app on your device to inspect its properties. This is useful for understanding how each widget beh",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is `InheritedWidget` in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\n`InheritedWidget` is a class in the Flutter framework that is used to pass data down the widget tree. It provides a convenient way to share data between widgets without having to pass the data explicitly through each individual widget in the tree.\n\nAn `InheritedWidget` is a widget that",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is `vsync`? Explain.",
    "answer_preview": "**📚 GITHUB**\n\nThe `vsync` in Flutter is an abbreviation for \"vertical synchronization\". It's a feature that ensures that animations and user interface updates are synchronized with the device's screen refresh rate. This prevents visual artifacts, such as screen tearing or stuttering, which can occur",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is a `CustomPainter` in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, a `CustomPainter` is a class that allows to create custom graphics and animations by painting on a Canvas. It is used in conjunction with a `CustomPaint` widget to create custom visuals that can be added to a widget tree.\n\nTo use `CustomPainter`, we need to create a class t",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is code-splitting in Flutter, and how does it help?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, code-splitting refers to dividing your app's code into smaller, independent modules that can be loaded on demand, rather than loading the entire app at once. This technique is typically used with deferred components or dynamic libraries.\n\n**Benefits:**\n- Reduced initial loa",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is Flutter Tree Shaking?",
    "answer_preview": "**📚 GITHUB**\n\n`Tree shaking` is a technique used by modern compilers to reduce the size of the output by eliminating code that is not being used. In Flutter, `tree shaking` refers to the process of removing unused widgets, libraries, and other code from the final build of an application. This helps ",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is isolate in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nAn `Isolate` in Flutter is a separate thread of execution that runs concurrently with the main isolate (thread) of a Flutter application. An isolate has its own memory heap, so it can run code and access data independently of the main isolate. This allows you to run CPU-intensive or bl",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is the difference between hot reload and hot restart?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n### Hot Reload\n\nIn Flutter, **Hot Reload** is the easiest and quickest way to make any changes, create UIs, fix bugs, and add features to the app. A Hot Reload performs all these changes rapidly and makes changes in the UI without disturbing the entire app.\n\n**How to perform H",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is the Flutter rendering pipeline and how does it work?",
    "answer_preview": "**📚 GITHUB**\n\nThe Flutter rendering pipeline is the process through which Flutter converts UI code into pixels on the screen. It has the following stages:\n\n1. **UI Widgets:** The Flutter app starts with the widget tree, where you define the structure of your UI. This tree is immutable.\n2. **Element ",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "What is the role of the `FlutterEngine` in the Flutter framework?",
    "answer_preview": "**📚 GITHUB**\n\nThe Flutter Engine is a portable runtime for hosting Flutter applications. It implements Flutter's core libraries, including animation and graphics, file and network I/O, accessibility support, plugin architecture, and a Dart runtime and compile toolchain. It:\n\n- Executes Dart code in ",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "Why do we need separate directories for iOS and Android in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nHere's why you would need two different directories for Android and iOS files in Flutter:\n\n### Android Folder\nYou need an Android folder to keep files of an Android project. When any Flutter framework creates the code, the compiler converts the Flutter code into native code th",
    "source": "ADVANCED",
    "difficulty": "advanced"
  },
  {
    "question": "How does InheritedWidget work, and when would you create one?",
    "answer_preview": "`InheritedWidget` propagates immutable data down the widget tree efficiently. It allows descendant widgets to access data without explicitly passing it through constructors.\n\n### Use cases:\n- Sharing themes across the app\n- Providing localization data\n- Sharing app-wide configuration\n- Any data that",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What's the difference between Provider, Riverpod, and Bloc?",
    "answer_preview": "- **Provider:** A wrapper around `InheritedWidget` for dependency injection and state management. Simple to use and integrates well with Flutter's widget tree.\n\n- **Riverpod:** A safer, more testable evolution of Provider. It doesn't depend on `BuildContext` and offers compile-time safety, better te",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How do you write a custom RenderBox?",
    "answer_preview": "To create a custom `RenderBox`:\n\n1. Extend `RenderBox`\n2. Implement required methods:\n   - `performLayout()`: Calculate and set the size\n   - `paint()`: Draw the widget\n   - Optional: `hitTest()` for touch interactions\n\nUse custom `RenderBox` for:\n- Low-level rendering needs\n- Custom layout algorith",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What is the widget lifecycle of a StatefulWidget?",
    "answer_preview": "The lifecycle stages are:\n\n1. **createState()** - Creates the mutable state object\n2. **initState()** - Called once when state is created\n3. **didChangeDependencies()** - Called when dependencies change\n4. **build()** - Called to build the widget tree (called frequently)\n5. **didUpdateWidget()** - C",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How would you optimize build performance in a complex widget tree?",
    "answer_preview": "Optimization strategies:\n\n- **Use const constructors** - Allows widget reuse and prevents unnecessary rebuilds\n- **Use RepaintBoundary** - Isolates parts of the tree from repainting\n- **Use ValueListenableBuilder** - Rebuilds only the listening widget, not the entire tree\n- **Isolate rebuilds** - Ex",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How does Flutter's rendering pipeline work?",
    "answer_preview": "Flutter's rendering follows a three-tree architecture:\n\n**Widget → Element → RenderObject**\n\n### Phases:\n- **Build phase:** Creates/updates the widget tree\n- **Layout phase:** Determines size and position of each RenderObject\n- **Paint phase:** Draws each RenderObject to layers\n- **Compositing phase",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What's the purpose of GlobalKey, and what are its downsides?",
    "answer_preview": "`GlobalKey` allows access to a widget's state from anywhere in the widget tree.\n\n### Uses:\n- Access state across different parts of the tree\n- Call methods on a widget's state\n- Maintain state when moving widgets\n- Form validation across complex UIs\n\n### Downsides:\n- Potential memory leaks if not di",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How do you write platform-specific code in Flutter?",
    "answer_preview": "Use `MethodChannel` for communication between Dart and native code:\n\n### Dart side:\n```dart\nconst platform = MethodChannel('com.example/channel');\n\ntry {\n  final result = await platform.invokeMethod('methodName', arguments);\n} catch (e) {\n  // Handle error\n}\n```\n\n### Native side:\n- **Android:** Impl",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How would you debounce a TextField input?",
    "answer_preview": "Two common approaches:\n\n### Using Timer:\n```dart\nTimer? _debounce;\n\nvoid onSearchChanged(String query) {\n  if (_debounce?.isActive ?? false) _debounce!.cancel();\n  _debounce = Timer(const Duration(milliseconds: 500), () {\n    // Perform search\n  });\n}\n\n@override\nvoid dispose() {\n  _debounce?.cancel(",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What are isolates in Dart and when should they be used?",
    "answer_preview": "Isolates are parallel computing units in Dart that run code without sharing memory. Each isolate has its own memory heap and event loop.\n\n### Use isolates for:\n- CPU-intensive tasks (parsing large JSON, image processing)\n- Long-running computations\n- Preventing UI blocking\n- Complex mathematical cal",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How do you persist offline data in Flutter?",
    "answer_preview": "Several options depending on needs:\n\n### For structured data:\n- **sqflite** - SQLite database for relational data\n- **Hive** - Lightweight, fast NoSQL database\n- **ObjectBox** - High-performance NoSQL database with relations\n\n### For simple key-value storage:\n- **shared_preferences** - Simple key-va",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How would you securely store tokens on a device?",
    "answer_preview": "Use `flutter_secure_storage` package, which leverages:\n- **Android:** Android Keystore for encrypted storage\n- **iOS:** iOS Keychain for secure storage\n\n```dart\nfinal storage = FlutterSecureStorage();\n\n// Write\nawait storage.write(key: 'token', value: 'your_secure_token');\n\n// Read\nString? token = a",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How would you write a performant infinite scroll list?",
    "answer_preview": "Implement using these strategies:\n\n1. **Use ListView.builder()** - Creates items lazily\n2. **Implement ScrollController** - Detect when user reaches bottom\n3. **Load items in batches** - Don't load all data at once\n4. **Cache loaded items** - Prevent reloading same data\n5. **Add loading indicator** ",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What's the role of RepaintBoundary?",
    "answer_preview": "`RepaintBoundary` prevents unnecessary repaints by isolating parts of the widget tree. When a `RepaintBoundary` is used:\n\n- Flutter creates a separate layer for that subtree\n- Changes inside don't trigger repaints outside\n- Changes outside don't trigger repaints inside\n\n### Benefits:\n- Improves rend",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How would you profile and analyze a Flutter app's performance?",
    "answer_preview": "Multiple tools and techniques:\n\n### Flutter DevTools:\n- Performance tab for frame rendering analysis\n- Timeline view for detailed profiling\n- Memory tab for memory leaks\n\n### Command line:\n- Run with `flutter run --profile` (optimized but debuggable)\n- Use `flutter run --release` for final performan",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How does setState() differ from ValueNotifier and ChangeNotifier?",
    "answer_preview": "### setState():\n- Scoped to a single `StatefulWidget`\n- Triggers rebuild of that widget only\n- Simple and straightforward\n- Best for local, widget-specific state\n\n### ValueNotifier:\n- Holds a single value\n- Notifies listeners when value changes\n- Can be used across multiple widgets\n- Lightweight for",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What are some ways to handle dependency injection in Flutter?",
    "answer_preview": "Several approaches:\n\n### Provider:\n- Most popular\n- Integrates with widget tree\n- Simple and intuitive\n\n### get_it:\n- Service locator pattern\n- Independent of widget tree\n- Great for services and repositories\n\n### Riverpod:\n- Evolution of Provider\n- Compile-time safety\n- No BuildContext dependency\n-",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How do you manage app state across multiple modules?",
    "answer_preview": "Use centralized state management solutions:\n\n### Riverpod:\n- Providers accessible from anywhere\n- No BuildContext needed\n- Type-safe and testable\n\n### Bloc/Cubit:\n- Clear separation of business logic\n- Predictable state transitions\n- Great for complex flows\n\n### Redux:\n- Single source of truth\n- Pre",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How would you architect a plugin that uses platform channels?",
    "answer_preview": "Structure for a robust plugin:\n\n1. **Create a MethodChannel** in Dart\n2. **Define a clear contract** for native methods\n3. **Implement platform-specific code:**\n   - Android: Kotlin/Java\n   - iOS: Swift/Objective-C\n4. **Handle result parsing** in Dart\n5. **Add error handling** for platform failures\n",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How does Flutter handle accessibility?",
    "answer_preview": "Flutter provides comprehensive accessibility support:\n\n### Built-in features:\n- Semantic widgets automatically expose information\n- Screen reader support (TalkBack/VoiceOver)\n- Semantic labels and hints\n- Semantic actions\n\n### Semantics widget:\n```dart\nSemantics(\n  label: 'Submit button',\n  hint: 'D",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What is the difference between mainAxisSize.min and mainAxisSize.max?",
    "answer_preview": "### mainAxisSize.min:\n- Widget wraps its content\n- Takes only the space needed by children\n- Shrinks to fit\n\n### mainAxisSize.max:\n- Widget expands to fill available space along main axis\n- Takes all available space from parent\n\n```dart\n// min - wraps content\nColumn(\n  mainAxisSize: MainAxisSize.min",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How does Flutter's widget tree differ from element and render trees?",
    "answer_preview": "Flutter uses three trees:\n\n### Widget tree:\n- Immutable configuration\n- Describes the UI structure\n- Lightweight\n- Rebuilt frequently\n\n### Element tree:\n- Manages widget lifecycle and state\n- Mutable\n- Links widgets to render objects\n- Persists across builds\n- Handles widget updates efficiently\n\n###",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What are the risks of using BuildContext after await?",
    "answer_preview": "After an `await`, the widget might be disposed, leading to:\n\n### Risks:\n- Widget no longer mounted\n- BuildContext invalid\n- Runtime errors when using context\n- Unexpected behavior\n\n### Solutions:\n\n**1. Check if mounted:**\n```dart\nFuture<void> loadData() async {\n  final data = await fetchData();\n  if",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How do you test a widget that uses animation?",
    "answer_preview": "Use `WidgetTester` methods:\n\n### pumpAndSettle():\n- Waits for all animations to complete\n- Useful for implicit animations\n\n### pump(Duration):\n- Advances clock by specified duration\n- Simulates animation frames\n- Allows testing specific animation states\n\n```dart\ntestWidgets('Animation test', (Widget",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How would you implement dynamic theming?",
    "answer_preview": "Implement theme switching with state management:\n\n```dart\nclass ThemeProvider extends ChangeNotifier {\n  ThemeMode _themeMode = ThemeMode.light;\n  \n  ThemeMode get themeMode => _themeMode;\n  \n  void toggleTheme() {\n    _themeMode = _themeMode == ThemeMode.light \n      ? ThemeMode.dark \n      : Theme",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What are keys used for in animations?",
    "answer_preview": "Keys preserve widget identity across frames in animations:\n\n### Purpose:\n- Help Flutter track widgets during animation\n- Preserve state when widgets move\n- Ensure smooth transitions\n- Prevent widget confusion in lists\n\n### Types:\n- `ValueKey` - Based on a value\n- `ObjectKey` - Based on object identi",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How do you handle background fetch on Android and iOS?",
    "answer_preview": "Use platform-specific plugins:\n\n### Recommended plugin: workmanager\n```dart\nimport 'package:workmanager/workmanager.dart';\n\nvoid callbackDispatcher() {\n  Workmanager().executeTask((task, inputData) async {\n    // Background fetch logic\n    await fetchData();\n    return Future.value(true);\n  });\n}\n\nv",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "How do you update a large list efficiently without rebuilding the entire list?",
    "answer_preview": "Several optimization strategies:\n\n### 1. Use ListView.builder:\n- Creates items lazily\n- Only renders visible items\n\n### 2. Assign Keys to items:\n```dart\nListView.builder(\n  itemBuilder: (context, index) {\n    return ListTile(\n      key: ValueKey(items[index].id),\n      title: Text(items[index].name)",
    "source": "LEMON",
    "difficulty": "advanced"
  },
  {
    "question": "What is a StatefulWidget and when would you use it?",
    "answer_preview": "A `StatefulWidget` is a widget with mutable state that can change during its lifetime. It is a built-in Flutter approach to make the UI dynamically update. Use it to create dynamic, interactive UI elements that need to update their visual representation based on user interaction or other events.\n\n--",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between hot reload and hot restart?",
    "answer_preview": "- **Hot reload:** Injects new code into the Dart VM and preserves the current state. It's fast and maintains your app's current state.\n- **Hot restart:** Fully rebuilds the app and resets all state. It's a complete restart of the application.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What's the purpose of the build() method in Flutter?",
    "answer_preview": "The `build()` method describes how to display the widget using a tree of other widgets. It's called every time the UI needs to be updated. The method returns a widget tree that represents the visual structure of your widget.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "Explain setState() and when to call it",
    "answer_preview": "`setState()` tells Flutter that the state of the widget has changed and the UI should be rebuilt. Use it when you want to update the visual representation of data. Call it whenever you modify state variables that affect what the widget displays.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between final and const?",
    "answer_preview": "- `final`: Assigned once at runtime. The value is set when the object is created and cannot be changed afterward.\n- `const`: Assigned at compile-time and is deeply immutable. The value must be known at compile time.\n- **Recommendation:** Use `const` for performance optimization where possible, as it",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you navigate to a new screen in Flutter?",
    "answer_preview": "Use the `Navigator.push()` method with a `MaterialPageRoute` to navigate to a new screen.\n\n```dart\nNavigator.push(\n  context, \n  MaterialPageRoute(builder: (_) => NewScreen())\n);\n```\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What does ListView.builder do?",
    "answer_preview": "`ListView.builder` builds list items lazily as they scroll into view. This improves performance for long lists by only creating widgets for visible items, resulting in efficient memory management. Items are created on-demand rather than all at once.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you use FutureBuilder?",
    "answer_preview": "`FutureBuilder` listens to a Future and rebuilds its child based on the connection state. It handles three main states:\n- **Waiting:** While the future is loading\n- **Done:** When the future completes successfully\n- **Error:** If the future completes with an error\n\nThis widget is ideal for loading a",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What are keys in Flutter and why are they used?",
    "answer_preview": "Keys preserve widget state when widgets are moved or change position in the widget tree. They are useful in:\n- Lists where items can be reordered\n- Animations\n- Any scenario where Flutter needs to identify and track specific widgets across rebuilds\n\nKeys help Flutter determine which widgets have cha",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you handle user input with TextField?",
    "answer_preview": "Use a `TextEditingController` to read and manipulate input from a TextField. You can:\n- Access the current text value via `controller.text`\n- Listen for changes using `controller.addListener()`\n- Use the `onChanged` callback for real-time updates as the user types\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is SingleChildScrollView and when do you use it?",
    "answer_preview": "`SingleChildScrollView` is a scrollable container for a single widget (like a `Column`). Use it when the content might overflow vertically and needs to be scrollable. It's ideal for forms or layouts that might exceed the screen height.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the pubspec.yaml file?",
    "answer_preview": "The `pubspec.yaml` file is the configuration file where you declare:\n- Project metadata (name, description, version)\n- Dependencies (packages your app uses)\n- Assets (images, fonts, other files)\n- Font declarations\n- Flutter SDK constraints\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What does the main() function do in a Flutter app?",
    "answer_preview": "The `main()` function is the app's entry point. It's the first function that runs when your Flutter app starts. Usually, it calls `runApp(MyApp())` to inflate the widget tree and start the app.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you create a rounded button in Flutter?",
    "answer_preview": "Use an `ElevatedButton` with a custom shape such as `RoundedRectangleBorder` with a `borderRadius` property.\n\n```dart\nElevatedButton(\n  style: ElevatedButton.styleFrom(\n    shape: RoundedRectangleBorder(\n      borderRadius: BorderRadius.circular(20),\n    ),\n  ),\n  onPressed: () {},\n  child: Text('Ro",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you add padding or margin around a widget?",
    "answer_preview": "- Use `Padding(padding: EdgeInsets.all(16))` to add internal spacing\n- Or wrap the widget in a `Container` with `margin` or `padding` properties\n\nBoth approaches allow you to add space around widgets.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What's the purpose of Expanded?",
    "answer_preview": "`Expanded` forces a child of `Row`, `Column`, or `Flex` to take up all remaining available space. It's used to fill available space in flex layouts and can accept a `flex` parameter to control how much space it takes relative to other `Expanded` widgets.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is MediaQuery.of(context).size used for?",
    "answer_preview": "`MediaQuery.of(context).size` gets the device screen dimensions (width and height). It's useful for:\n- Creating responsive designs\n- Adapting layouts to different screen sizes\n- Calculating widget sizes based on screen dimensions\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between MainAxisAlignment and CrossAxisAlignment?",
    "answer_preview": "- **MainAxisAlignment:** Aligns children along the main axis (horizontal in Row, vertical in Column)\n- **CrossAxisAlignment:** Aligns children along the perpendicular/cross axis\n\nThese properties control how children are positioned within `Row`, `Column`, and `Flex` widgets.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between Column and ListView?",
    "answer_preview": "- **Column:** Lays out all children vertically at once. Non-scrollable by default. Best for a fixed number of children.\n- **ListView:** Scrollable and efficient for long or dynamic content. Creates children lazily on demand.\n\nUse `Column` for simple layouts, `ListView` for scrollable lists.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is a Container in Flutter?",
    "answer_preview": "`Container` is a versatile box widget that combines common painting, positioning, and sizing widgets. It can have:\n- Padding\n- Margin\n- Decoration (borders, backgrounds, shadows)\n- Width and height constraints\n- Alignment\n\nIt's one of the most commonly used widgets for layout and styling.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What does Stack do and when should it be used?",
    "answer_preview": "`Stack` overlays widgets on top of each other. The first child is at the bottom, and subsequent children are painted on top. Use it for:\n- Complex UI layouts like banners\n- Image overlays\n- Free positioning of widgets\n- Creating layered designs\n\nChildren can be positioned using `Positioned` widgets.",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you show a dialog in Flutter?",
    "answer_preview": "Use `showDialog()` with a widget like `AlertDialog`:\n\n```dart\nshowDialog(\n  context: context,\n  builder: (context) => AlertDialog(\n    title: Text('Dialog Title'),\n    content: Text('Dialog content'),\n    actions: [\n      TextButton(\n        onPressed: () => Navigator.pop(context),\n        child: Te",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you validate a form in Flutter?",
    "answer_preview": "1. Wrap input fields in a `Form` widget\n2. Assign a `GlobalKey<FormState>()`\n3. Add `validator` functions to form fields\n4. Call `formKey.currentState!.validate()` to validate all fields\n\n```dart\nfinal formKey = GlobalKey<FormState>();\n\nForm(\n  key: formKey,\n  child: TextFormField(\n    validator: (v",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you load an image from the internet?",
    "answer_preview": "Use `Image.network()` with the URL:\n\n```dart\nImage.network('https://example.com/image.jpg')\n```\n\nYou can optionally add:\n- `loadingBuilder` to show a loading indicator\n- `errorBuilder` to handle loading errors\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you detect a button press?",
    "answer_preview": "Set the `onPressed` callback in button widgets like `TextButton`, `ElevatedButton`, or `IconButton`:\n\n```dart\nElevatedButton(\n  onPressed: () {\n    // Handle button press\n  },\n  child: Text('Press Me'),\n)\n```\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What does SafeArea do?",
    "answer_preview": "`SafeArea` adds padding to avoid system UI elements such as:\n- Status bar\n- Notches\n- Home indicators\n- System navigation bars\n\nIt keeps content within safe visible bounds, ensuring your UI isn't obscured by system elements.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the initState() method?",
    "answer_preview": "`initState()` is called once when the widget is inserted into the widget tree. Use it to:\n- Initialize data\n- Set up listeners\n- Start animations\n- Subscribe to streams\n- Perform one-time setup operations\n\nIt's called before the first `build()` call.\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How can you prevent a widget from rebuilding?",
    "answer_preview": "Several strategies:\n- Use `const` constructors to create compile-time constants\n- Use `Keys` to preserve widget identity\n- Extract static widgets into separate const widgets\n- Use `RepaintBoundary` to isolate rebuilds\n- Implement `shouldRebuild` in custom widgets\n\n---",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "How do you apply custom fonts in a Flutter app?",
    "answer_preview": "1. Add the font files to your assets (usually in a `fonts/` directory)\n2. Declare them in `pubspec.yaml`:\n```yaml\nflutter:\n  fonts:\n    - family: CustomFont\n      fonts:\n        - asset: fonts/CustomFont-Regular.ttf\n        - asset: fonts/CustomFont-Bold.ttf\n          weight: 700\n```\n3. Reference th",
    "source": "LEMON",
    "difficulty": "basic"
  },
  {
    "question": "Single subscription streams",
    "answer_preview": "- The most common kind of stream\n- Contains a sequence of events that are parts of a larger whole\n- Events need to be delivered in the correct order and without missing any\n- This is the kind of stream you get when you read a file or receive a web request\n- Can only be listened to once\n- When you st",
    "source": "MEDIUM",
    "difficulty": "intermediate"
  },
  {
    "question": "What do you mean by Streams?",
    "answer_preview": "In asynchronous programming, streams are used to provide a sequence of data in an asynchronous manner. Similar to a pipe, we put a value on one end and a listener receives it on the other. Several listeners can be put into one stream, and they'll all get the same value when they're put in the pipeli",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What are different types of Streams?",
    "answer_preview": "The streams' functionality is part of Dart and is inherited by Flutter. In Flutter, there are two kinds of streams:\n\n### Single Subscription Streams\n\n- Deliver events sequentially\n- Considered as sequences contained within a larger whole\n- Used when the order in which events are received matters, su",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What do you mean by flutter SDK?",
    "answer_preview": "A Flutter SDK (Software Development Kit) enables developers to build applications for mobile, web, and desktop using a single codebase.\n\n### Flutter SDK includes:\n\n- Dart SDK\n- Rendering engine, widgets, APIs for testing and integration\n- Compilation tools for Native Machine Code (code for iOS and A",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "Write difference between Hot reload and Hot restart",
    "answer_preview": "For any dart application, the initial execution requires a fair amount of time. Therefore, to solve this problem, flutter has two features: Hot Reload and Hot Restart, which reduce the execution time of our app after we run it.\n\n| Hot Reload | Hot Restart |\n|------------|-------------|\n| Takes appro",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "Explain BuildContext",
    "answer_preview": "BuildContexts are used to identify or locate widgets in widget trees. Each widget has its own BuildContext, i.e., one BuildContext per widget. Basically, we're using it to find references to other widgets and themes. In addition, you can utilize it to interact with widget parents and access widget d",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What do you mean by Widget testing?",
    "answer_preview": "Flutter supports three types of tests:\n\n### Unit tests\n\n- Test a class or method\n- Do not check for rendering to screen, interacting with external services, or user interactions\n\n### Widget tests\n\n- Test a single widget\n- Ensure that the widget's UI looks as expected and responds appropriately to ev",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What is state management?",
    "answer_preview": "Whether you are building a mobile app or a web application, State Management is crucial. Using it, states of various UI controls are centralized to handle data flow across an application. It can be a text field, radio button, checkbox, dropdown, toggle, form, and so on.\n\nIn Flutter, state management",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "Explain pubspec.yaml file",
    "answer_preview": "The pubspec.yaml file, also known as 'pubspec', is a file that is included when you create a Flutter project and is located at the top of the project tree. This file contains information about the dependencies like packages and their versions, fonts, etc., that a project requires. It makes sure that",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What do you understand about tween animation?",
    "answer_preview": "The shortened version of in-between animation is tween animation. The start and endpoints of an animation must be specified in tween animation. Using this method, the animation can begin at the beginning and can progress through a series of values until it reaches the endpoint. Transition speed and ",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "How can we create HTTP requests in Flutter?",
    "answer_preview": "To create HTTP requests, use the HTTP package: `import 'package:http/http.dart' as http;`\n\n### Example:\n\n```dart\nhttp.get('https://jsonplaceholder.typicode.com/albums/1');\n```\n\nIt will return a `Future<http.Response>`.\n\n---",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "Name two database packages mostly used in Flutter",
    "answer_preview": "### Firebase database\n\nGives users access to and control over the cloud database. Firebase basically provides a NoSQL database for Flutter apps with the ability to manage data retrieval and storage through JSON protocol. Data sync and quick loading make it one of the most suitable options for Flutte",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "Explain Flutter Provider",
    "answer_preview": "The provider is built using widgets. You can use all the objects in the provider as if they were just part of Flutter with the new widget subclasses it creates. This also means that the provider is not cross-platform. The provider is the simplest way to handle state management. Basically, it works o",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What is await in Flutter? Write its usage",
    "answer_preview": "Until the async method is finished, await interrupts the process flow. Await generally means: Wait here until this function is finished so that you can get its return value. Await can only be used with async. Using this, all currently running functions are put on hold until the Future is complete.\n\n",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "Write the difference between SizedBox Vs Container",
    "answer_preview": "| Container | SizedBox |\n|-----------|----------|\n| Multiple child widgets can be controlled by adjusting size, padding, and color | Specific size box with limited functionality |\n| Allows setting widget's color or decoration | Does not allow setting color or decoration |\n| Used when styling is need",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What do you mean by Null-aware operators?",
    "answer_preview": "Null-aware operators in dart allow you to make computations based on whether or not a value is null. Dart provides some useful information to handle the null values.\n\n### The \"??=\" assignment operator\n\nAssigns a value to a variable only if it is null.\n\n```dart\nint a;                        // a is i",
    "source": "INTERVIEWBIT",
    "difficulty": "advanced"
  },
  {
    "question": "What is the use of Ticker in Flutter?",
    "answer_preview": "We use a ticker to tell how often our animation is refreshed in Flutter. Signals are sent at a constant frequency, such as 60 times per second, using this type of signal-sending class. We understand it better with our watch, which ticks constantly. For each tick, a callback method is provided that h",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Explain Flutter Inspector",
    "answer_preview": "In the same manner, as with Native Android, the XML file allows us to view our app's blueprint and properties. There is a powerful tool called Flutter Inspector for Flutter applications that allows you to visualize the blueprint of your widgets and their properties. Using it, you can diagnose variou",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "How would you execute code only in debug mode?",
    "answer_preview": "We first need to import the dart foundation in order to run the code only in debug mode:\n\n```dart\nimport 'package:flutter/foundation.dart' as Foundation;\n```\n\nThe next step is to use `kReleaseMode` as follows:\n\n```dart\nif (Foundation.kReleaseMode) {  // is Release Mode??\n  print('release mode');\n} e",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "What is the use of Mixins?",
    "answer_preview": "Multiple inheritances are not supported by Dart. Thus, we need mixins to implement multiple inheritances in Flutter/Dart. The use of mixins makes it easy to write reusable class code in multiple class hierarchy levels. Mixins can also be used to provide some utility functions (such as RenderSliverHe",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Explain packages and plugins in Flutter",
    "answer_preview": "A package is a collection of classes, interfaces, and sub-packages that enable the creation of modular code that can be shared easily among users. Applications can be quickly developed using packages instead of developing everything from scratch. You can import new widgets or functionality into an a",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Explain the flutter architecture",
    "answer_preview": "The structure of Flutter consists of three layers:\n\n1. **Upper layers**: The Dart-based platform that takes care of app widgets, gestures, animations, illustrations, and materials\n2. **Flutter engine**: Handles the display and formatting of text\n3. **Built-in service**: Used for the management of pl",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "List some important features of flutter",
    "answer_preview": "Among the main features of flutter for developing mobile frameworks are:\n\n- **Flexibility, scalability, and integration**: Flutter's easy-to-use and easy-to-integrate framework provides enhanced flexibility, scalability, and integration capabilities\n- **Hot Reload**: If the developer modifies the co",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Write the limitations of flutter",
    "answer_preview": "Flutter has the following limitations:\n\n- **Third-party libraries are limited**: Since Flutter is relatively new, the number of third-party libraries is small. Additionally, some widgets in Flutter are only available on one platform\n- **Release size is larger**: Developers get frustrated when the re",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "What are different build modes in flutter?",
    "answer_preview": "Depending on your development phase, the framework compiles your code in different ways or modes, which we called a build mode. Flutter's tooling allows the application to be compiled in three modes:\n\n- **Debug Mode**: This mode enables debugging of apps on a physical device, emulator, or simulator.",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Explain the flutter widget and write its importance",
    "answer_preview": "Generally, a Flutter app consists of a number of widgets. A widget is a way to declare and construct user interfaces. In Flutter, you must write code inside a widget in order to build anything. With the widget, you can see how your app would appear with its current configuration. As soon as you modi",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "What are the types of widgets present in flutter?",
    "answer_preview": "In flutter, widgets can be divided into two categories:\n\n- **Stateless Widget**: A widget that does nothing is a Stateless Widget. In essence, they are static and don't store any state. Thus, they don't save values that may change\n- **Stateful Widget**: A widget that does anything is a Stateful Widg",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by Dart? Write its importance",
    "answer_preview": "Dart, a programming language developed by Google, is used to code Flutter apps as well as server and desktop applications. By using Dart, Flutter avoids the use of a separate declarative layout language such as JSX or XML.\n\nA simple Dart program:\n\n```dart\nvoid main() {\n  for (int i = 0; i < 5; i++) ",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Explain App state",
    "answer_preview": "App State may also be referred to as a shared state or application state. It is possible to share app states across sections of your app and maintain user sessions in the same way.\n\nHere are some examples of App State:\n\n- Login info\n- User preferences\n- E-commerce shopping cart\n- Social networking n",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Write the difference between runApp() and main() in flutter",
    "answer_preview": "- **main()**: This function starts the program. Flutter does not allow us to write any program without the main() function\n- **runApp()**: Using runApp(), you are able to return the widgets that are connected to the screen as a root of the widget tree that will be rendered on the screen. This functi",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Write the advantages of using flutter",
    "answer_preview": "For developing mobile applications, Flutter usually fulfills the custom needs and requirements. It offers the following advantages:\n\n- **Reduce Code Development**: Flutter's hot reload feature allows it to offer faster performance. With it, the application gets compiled using the arm C/C++ library, ",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Name some best editors for flutter development",
    "answer_preview": "With the Flutter development tools, developers can make Flutter development faster and thus boost their productivity. Here are some popular IDEs for Flutter development:\n\n- Android Studio\n- Visual Studio\n- IntelliJ IDEA\n- Xcode\n- Eclipse\n- Emacs\n- Vim, etc.\n\n---",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Name some apps that mostly use flutter",
    "answer_preview": "Flutter is used today by many organizations for developing apps. The following are some of the most popular apps built on Flutter:\n\n- Google Ads\n- Reflectly\n- Alibaba\n- Birch Finance\n- Coach Yourself\n- Tencent\n- Watermaniac, etc.\n\n---",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by keys in flutter? When one should use it",
    "answer_preview": "Keys are used in Flutter as identifiers for widgets, elements, and semantic nodes. GlobalKeys and LocalKeys are the subclasses of Key. Within the widget tree, keys are responsible for preserving the state of modified widgets. With keys, you can also reorganize and modify collections of widgets that ",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Explain Container class in a flutter",
    "answer_preview": "Basically, in Flutter, a container is a widget that has the capacity to accommodate multiple child widgets and manage them efficiently through dimensions, padding, and background color. Whenever we want to style the background of a widget, either because of a color, shape, or size constraint, we may",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Which one is better, either flutter or react native?",
    "answer_preview": "Today, thousands of mobile apps are being built with the two most popular cross-platform development frameworks i.e., React Native and Flutter. There are many similarities between React Native and Flutter including reloading quickly, excellent UI, awesome tooling, and capability to build native apps",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "When to use mainAxisAlignment and crossAxisAlignment",
    "answer_preview": "The mainAxisAlignment is how items are aligned on that axis, whereas crossAxisAlignment is how items are aligned on the other axis. Row and column widgets can align their children according to our preferences using the crossAxisAlignment and the mainAxisAlignment properties.\n\n### For Row Widget:\n- C",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Is Flutter Open Source or not?",
    "answer_preview": "Yes, Flutter is a free and open-source UI software development kit from Google that allows developers to build cross-platform mobile apps with ease.\n\n---",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "Why does a flutter app usually take a long developing time?",
    "answer_preview": "The first time you build a Flutter application, it takes much longer than usual since Flutter creates a device-specific IPA or APK file. Xcode and Gradle are used in this process to build a file, which usually takes a lot of time.",
    "source": "INTERVIEWBIT",
    "difficulty": "basic"
  },
  {
    "question": "What is `BuildContext` in Flutter? And why is it needed?",
    "answer_preview": "`BuildContext` is a locator that tracks and locates each widget in a widget tree. `BuildContext` objects are passed to **WidgetBuilder** functions, and are available from the `State.context` member. Some static functions (e.g. **showDialog**, **Theme.of**, and so forth) also take build contexts so t",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are different build modes in Flutter?",
    "answer_preview": "The Flutter tooling supports three different build modes while compiling the app. We need to choose the build mode depending upon where we are in the development cycle.\n\n- `debug`: For development purpose, the **hot reload** feature is enabled only in the debug mode.\n- `profile`: For analyzing the a",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between `WidgetsApp` and `MaterialApp` in Flutter?",
    "answer_preview": "`WidgetsApp` is a convenient widget that wraps a number of widgets that are commonly required for an application. It also provides basic navigation.\n\n`MaterialApp` builds an application that uses the mterial design. It is built upon the `WidgetsApp` and contains some material-design specific functio",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are `StatefulWidget` Lifecycle methods. Explain briefly.",
    "answer_preview": "- **createState() method:** Whenever a StatefulWidget is created, the framework calls this method to create fresh State objects. This method must be overridden.\n\n- **initState() method:** This method is the first method that is called while creating a StatefulWidget class. Here we allocate our resou",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are keys and why do we need them?",
    "answer_preview": "Flutter uses keys to preserve the state and to uniquely identify specific widgets within a widget tree. It is used to preserve the state of the `StatefulWidget`s while they are being replaced with other widgets or just moved in the widget tree.\n\nThe most common usage of key is when we are dealing wi",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between `Expanded` and `Flexible` widget?",
    "answer_preview": "The only difference between these two widgets is the `Flexible` widget takes only the space needed by the child, whereas the `Expanded` widget enforces its child to take all the available space.\n\nThe `Expanded` widget in flutter is shorthand of `Flexible` with the fit set to **FlexFit. tight**.\n\n```",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the extension method in Dart?",
    "answer_preview": "Extension method allows us to add new functionality on top of existing libraries.For example, you can add extra functionality to the Dart core String library, that are only available in your app.\n\nSyntax to create an extension method:\n\n```\nextension <extension name> on <type> {\n  // (<member definit",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "Explain the `mounted` property. How is it important and when to use it?",
    "answer_preview": "The mounted property defines whether the state object, associated with it, is currently in the widget tree.\n\nAfter creating a State object and before calling initState, the framework **\"mounts\"** the State object by associating it with a BuildContext. The State object remains mounted until the frame",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is sound null safety?",
    "answer_preview": "**Sound null safety** makes types in code non-nullable by default and enables special static checks and compiler optimizations to guarantee that null-dereference errors won't appear at runtime because they will be spotted at compile-time and fixed.\n\n**Null safety** is a guarantee within an object-or",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are mixins? How to use them?",
    "answer_preview": "A mixin is a class whose methods and properties can be used by other classes – without subclassing. It's a reusable chunk of code that can be plugged in to any class that needs this functionality.\n\nExample of a mixin:\n\n```dart\n// To create a mixin, use `mixin` keyword instead of `class`.\nmixin Greet",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `AppLifecycleState`?",
    "answer_preview": "The `AppLifecycleState` defines the state that an application can be.\n\n- **detached (AppLifecycleState.detached):** This means the application is still hosted on flutter engine but is detached from any host views. It can either be in the progress of attaching a view when engine was first initializes",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between `NetworkImage` and `Image.network` in flutter?",
    "answer_preview": "`NetworkImage` class creates an object that provides an image from the src URL passed to it. It is not a widget and does not output an image to the screen.\n\n`Image.network` creates a widget that displays an image on the screen. It is just a named constructor on the **Image** class. It sets the image",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "Explain async, await and Future.",
    "answer_preview": "The `async` and `await` are keywords in Dart that enable asynchronous programming. They make it easier to write asynchronous code that is readable and easier to maintain.\n\n`Future` is a core Dart library that represents an asynchronous operation that will complete in the future. A `Future` object is",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `resizeToAvoidBottomInset`? When should we use it?",
    "answer_preview": "The `resizeToAvoidBottomInset` is a property in the `Scaffold` widget. It is a boolean property that determines whether the body of the `Scaffold` should be resized to avoid the on-screen keyboard when it is displayed.\n\nIt should be used when the body of the `Scaffold` contains a form or text input ",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `Animation` and `AnimationController`?",
    "answer_preview": "`Animation` is a way to describe a graphical representation of a changing value over time. It can be used to animate the properties of widgets, such as size, color, position, and opacity, to create smooth and visually appealing transitions.\n\n`AnimationController` is a central class in Flutter's anim",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "Differentiate between `Stream` and `Future` in Flutter.",
    "answer_preview": "`Stream` and `Future` are both used for asynchronous programming in Flutter, but they serve different purposes.\n\n`Future` is a one-time asynchronous operation that returns a single value. It represents a value that will be available in the future, either a result or an error. Futures are often used ",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you explain the process of creating custom widgets in Flutter?",
    "answer_preview": "The process of creating custom widgets in Flutter involves the following steps:\n\n1. **Extend the `StatelessWidget` or `StatefulWidget` class**: To create a custom widget, we need to extend the `StatelessWidget` or `StatefulWidget` class, depending on whether the widget is stateless or stateful.\n\n2. ",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is Typedef in Dart?",
    "answer_preview": "The `typedef` in Dart is a way to define a new type alias for a function type. It allows us to give a name to a function type and use that name to declare variables, function parameters, or return types. A `typedef` is useful when we want to refer to a complex function type multiple times in our cod",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `FutureBuilder` in Flutter and how is it used to build dynamic UI?",
    "answer_preview": "`FutureBuilder` is a widget in Flutter that allows us to build a dynamic UI based on the value of a Future. A Future is an asynchronous operation that returns a value in the future. For example, we might use a Future to retrieve data from a server, or to perform a long-running computation.\n\nThe `Fut",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "How do you handle exceptions in Flutter, and what strategies have you used?",
    "answer_preview": "Exceptions are errors that occur at runtime and can be handled in Flutter using `try-catch` blocks. Here's a simple example of how to handle exceptions in Flutter:\n\n```dart\ntry {\n  // Code that might throw an exception\n} on Exception catch (e) {\n  // Code that is executed when an exception is caught",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are DevTools in Flutter?",
    "answer_preview": "`DevTools` in Flutter are a set of powerful web-based tools for debugging and profiling Flutter applications. They provide developers with detailed information about their apps, including CPU usage, memory usage, GPU rendering, and network activity. DevTools can be used to identify performance bottl",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is Factory constructor?",
    "answer_preview": "A factory constructor in Flutter is a special type of constructor that returns an instance of a class, but it does not necessarily create a new object every time it's called. The purpose of a factory constructor is to allow classes to provide alternative ways to create objects without exposing the i",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "Explain singleton class in flutter.",
    "answer_preview": "A singleton class is a class that can only be instantiated once throughout the entire application. It provides a single point of access to a shared instance of an object, which can be accessed from anywhere in the application.\n\nTo create a singleton class in Flutter, we need to define a private cons",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the event loop?",
    "answer_preview": "In Flutter, the event loop is a mechanism used to manage the flow of events and callbacks in an application. The event loop runs on a single thread and is responsible for processing events, such as user input or network I/O, and executing any associated callbacks.\n\nThe event loop works by maintainin",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between Provider vs. InheritedWidget?",
    "answer_preview": "Provider and InheritedWidget are both ways to share data between widgets in Flutter, but they differ in their implementation and approach.\n\nInheritedWidget is a built-in widget in Flutter that allows the sharing of data between widgets in a tree structure. It works by creating a tree of widgets, whe",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is a GlobalKey in Flutter?",
    "answer_preview": "A `GlobalKey` is a unique identifier for a widget in the widget tree, allowing the widget to be accessed and manipulated from outside of its parent or ancestor widgets. It is a class in the Flutter framework that can be used with stateful or stateless widgets to uniquely identify a widget.\n\nWith a `",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "How do you handle user input in Flutter?",
    "answer_preview": "In Flutter, we can handle user input through various widgets such as `TextField`, `Checkbox`, `Radio`, `Slider`, `DropdownButton`, `GestureDetector`, and more.\n\nHere is a simple process for handling user input in Flutter:\n\n1. Determine the widget that captures the user's input, such as a `TextField`",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `LayoutBuilder` widget in Flutter?",
    "answer_preview": "The `LayoutBuilder` widget in Flutter is used to get the constraints of the parent widget and build child widgets based on these constraints.\n\nThe purpose of `LayoutBuilder` is to enable creating responsive UIs that adapt to the size of their parent widget. The `LayoutBuilder` widget provides a call",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "How do you use the `ValueNotifier` class in Flutter?",
    "answer_preview": "In Flutter, the `ValueNotifier` class is a simple class that provides a way to listen for changes to a value and update the UI accordingly. It's a convenient way to manage state for a small number of widgets, and is often used in combination with the `ChangeNotifier` and `Provider` classes from the ",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is a `MediaQuery` in Flutter?",
    "answer_preview": "In Flutter, a `MediaQuery` is a widget that provides information about the device's screen size, orientation, and other display-related characteristics. It is typically used to create responsive UIs that adapt to different screen sizes and densities.\n\nThe `MediaQuery` widget is usually placed at the",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `didUpdateWidget` method in a StatefulWidget?",
    "answer_preview": "In Flutter, `StatefulWidget` is a widget that has mutable state that can change over time. When the state of a `StatefulWidget` changes, the framework rebuilds the widget tree to reflect the new state.\n\nThe `didUpdateWidget` method is a lifecycle method that is called when the framework rebuilds a `",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `AnimatedBuilder` widget in Flutter?",
    "answer_preview": "The `AnimatedBuilder` widget in Flutter is used to create complex animations by separating the animation logic from the widget tree. It provides a builder function that returns a widget tree, and an animation object that can be used to animate the properties of the widgets in the tree.\n\nHere's a sim",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `AnimatedSwitcher` widget in Flutter?",
    "answer_preview": "The `AnimatedSwitcher` widget in Flutter is used to create animated transitions between two or more widgets. The purpose of the `AnimatedSwitcher` widget is to provide an easy-to-use way to animate changes in the widget tree. When you use the `AnimatedSwitcher`, you can specify a new child widget to",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What is State Management in Flutter?",
    "answer_preview": "State management in Flutter refers to the management of the state of widgets and their properties in a Flutter app. State management is an essential concept in Flutter because it allows developers to create dynamic and interactive user interfaces that respond to user input and changes in data.\n\nIn F",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "How do you implement a draggable widget in flutter?",
    "answer_preview": "To implement a draggable widget in flutter, use the `Draggable` widget. Here's how to do it:\n\n- Use the `Draggable` widget to wrap the element you want to make draggable.\n- Pass the data you want to drag through the data property.\n- Use `feedback` to specify the widget that appears while dragging an",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "How do you provide accessibility when developing flutter apps, do you at all?",
    "answer_preview": "Yes, accessibility is a critical aspect of Flutter app development to ensure that the app is usable by everyone, including users with disabilities. In Flutter, several techniques are available to enhance accessibility:\n\n- **Use of Semantic Widgets:** Flutter provides `Semantics` widget, which allows",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "How to create a list with persistent headers?",
    "answer_preview": "To create a list with persistent headers in flutter, we can use the `CustomScrollView` widget along with `SliverList` and `SliverPersistentHeader`. This allows to have headers that remain visible as the user scrolls through the list.\n\nHere's how to do it:\n- Wrap the list and header in a `CustomScrol",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "Explain what a ticker is in flutter.",
    "answer_preview": "In Flutter, a ticker is a mechanism that helps to drive animations. It provides a continuous stream of time, essentially ticking at a fixed interval (typically the frame rate). This enables the animation framework to update the UI at a consistent rate.\n\nA `Ticker` is often used with `AnimationContro",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the various kinds of Streams present in flutter?",
    "answer_preview": "Streams in flutter are of two main types:\n\n**Single Subscription Stream**\n- Allows a single listener to subscribe at a time.\n- Suitable for sequential data processing, like events or user input.\n- Commonly used in situations like button clicks or network requests.\n\n**Broadcast Stream**\n\n- Allows mul",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the differences between JIT and AOT?",
    "answer_preview": "JIT stands for Just-in-Time vs AOT stands for Ahead-of-Time.\n\n- JIT compiles code during runtime. Used in development (e.g., hot reload) but has slower performance.\n- AOT compiles code before runtime (during build). Used in production for faster performance and optimized binary size.\n\nKey Difference",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "How do mixins differ from interfaces in Dart?",
    "answer_preview": "In Dart, mixins and interfaces serve different purposes:\n\n**Mixins:** Allow a class to reuse code from multiple classes without using inheritance. Mixins are typically used to add functionality to a class. They are declared using the mixin keyword and can be applied to a class via the with keyword. ",
    "source": "GITHUB",
    "difficulty": "intermediate"
  },
  {
    "question": "What are `Slivers`?",
    "answer_preview": "A sliver is a portion of a scrollable area that you can define to behave in a special way. You can use slivers to achieve custom scrolling effects, such as elastic scrolling.\n\nUnder the hood, slivers are used to implement all of the scrollable views you use, including ListView and GridView. Slivers ",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is `InheritedWidget` in Flutter?",
    "answer_preview": "`InheritedWidget` is a class in the Flutter framework that is used to pass data down the widget tree. It provides a convenient way to share data between widgets without having to pass the data explicitly through each individual widget in the tree.\n\nAn `InheritedWidget` is a widget that, when it is i",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is Flutter Tree Shaking?",
    "answer_preview": "`Tree shaking` is a technique used by modern compilers to reduce the size of the output by eliminating code that is not being used. In Flutter, `tree shaking` refers to the process of removing unused widgets, libraries, and other code from the final build of an application. This helps to reduce the ",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is `vsync`? Explain.",
    "answer_preview": "The `vsync` in Flutter is an abbreviation for \"vertical synchronization\". It's a feature that ensures that animations and user interface updates are synchronized with the device's screen refresh rate. This prevents visual artifacts, such as screen tearing or stuttering, which can occur when the devi",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is isolate in Flutter?",
    "answer_preview": "An `Isolate` in Flutter is a separate thread of execution that runs concurrently with the main isolate (thread) of a Flutter application. An isolate has its own memory heap, so it can run code and access data independently of the main isolate. This allows you to run CPU-intensive or blocking operati",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "Can you explain the process of testing a Flutter app?",
    "answer_preview": "The process of testing a Flutter app involves writing and running different types of tests to verify the behavior and functionality of the app. There are two main types of tests in Flutter: unit tests and integration tests. Unit tests focus on individual pieces of code, such as a single function or ",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is a `CustomPainter` in Flutter?",
    "answer_preview": "In Flutter, a `CustomPainter` is a class that allows to create custom graphics and animations by painting on a Canvas. It is used in conjunction with a `CustomPaint` widget to create custom visuals that can be added to a widget tree.\n\nTo use `CustomPainter`, we need to create a class that extends `C",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "Explain how you will deploy a Flutter app to the Google Play/App Store?",
    "answer_preview": "To deploy a Flutter app to the Google Play Store or App Store, follow these steps while adhering to their respective guidelines on content, user privacy, and design:\n\n**Deploying to Google Play Store:**\n- Google Play Developer Account: Create an account and set it up.\n- Generate a Signing Key: Sign ",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What are the advantages of a Flutter Inspector?",
    "answer_preview": "The Flutter Inspector provides several key features that help developers debug and optimize their applications:\n\n1. **Select Widget Mode:** Allows you to choose a widget directly from the app on your device to inspect its properties. This is useful for understanding how each widget behaves in the la",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "List the responsibilities of `FlutterActivity`.",
    "answer_preview": "`FlutterActivity` is the simplest and most direct way to integrate Flutter within an Android app.\n\n`FlutterActivity` maintains the following responsibilities:\n\n- Displays an Android launch screen.\n- Configures the status bar appearance.\n- Chooses the Dart execution app bundle path, entrypoint and en",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe how to implement internationalization in a flutter app?",
    "answer_preview": "To implement internationalization (i18n) in a Flutter app:\n\n- Include the `flutter_localizations` package in the `pubspec.yaml` file.\n- Set the `localizationsDelegates` and `supportedLocales` properties in the MaterialApp.\n- Use .arb files to store translations for different locales (e.g., app_en.ar",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a custom transition between screens in flutter?",
    "answer_preview": "To implement a custom transition between screens in flutter:\n\n- Use `PageRouteBuilder` to define the transition animations.\n- In the `pageBuilder`, define the widget for the new screen and use `Animation` objects to control the transition.\n- In the `transitionsBuilder`, use Flutter's animation widge",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a custom animation curve in flutter?",
    "answer_preview": "To implement a custom animation curve in Flutter:\n\n- Create a custom class that extends `Curve` and override the `transform` method to define the curve's behavior.\n- Apply the custom curve in an `Animation` object using `CurvedAnimation`.\n\n```dart\nclass CustomCurve extends Curve {\n  @override\n  doub",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "Can you communicate between isolates? Describe an Isolate?",
    "answer_preview": "Yes, you can communicate between isolates in Dart using message passing via `SendPort` and `ReceivePort`. Isolates do not share memory, and each isolate has its own memory space and event loop. To communicate, one isolate sends messages to another through a `SendPort`, and the receiving isolate list",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is the Flutter rendering pipeline and how does it work?",
    "answer_preview": "The Flutter rendering pipeline is the process through which Flutter converts UI code into pixels on the screen. It has the following stages:\n\n1. **UI Widgets:** The Flutter app starts with the widget tree, where you define the structure of your UI. This tree is immutable.\n2. **Element Tree:** The wi",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is the role of the `FlutterEngine` in the Flutter framework?",
    "answer_preview": "The Flutter Engine is a portable runtime for hosting Flutter applications. It implements Flutter's core libraries, including animation and graphics, file and network I/O, accessibility support, plugin architecture, and a Dart runtime and compile toolchain. It:\n\n- Executes Dart code in a separate iso",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What are platform channels in Flutter and when would you use them?",
    "answer_preview": "Platform channels in Flutter enable communication between Flutter's Dart code and the host platform's native code (e.g., Java/Kotlin on Android or Swift/Objective-C on iOS). They are used when you need to access platform-specific APIs or features not directly available in Flutter.\n\nWhen to use them:",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "How do you work with multiple Flutter flavors?",
    "answer_preview": "To work with multiple Flutter flavors, follow these steps:\n\n- Define flavors in android/app/build.gradle, add `productFlavors` like dev, staging, and prod with unique `applicationId`s.\n- Set up iOS schemes, create new schemes and configuration files in Xcode for each flavor.\n- Use Dart entry points,",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is code-splitting in Flutter, and how does it help?",
    "answer_preview": "In Flutter, code-splitting refers to dividing your app's code into smaller, independent modules that can be loaded on demand, rather than loading the entire app at once. This technique is typically used with deferred components or dynamic libraries.\n\n**Benefits:**\n- Reduced initial load time, only e",
    "source": "GITHUB",
    "difficulty": "advanced"
  },
  {
    "question": "What is Flutter?",
    "answer_preview": "Flutter is an open-source UI software development kit created by Google. It is used to develop cross platform applications for Android, iOS, Linux, macOS, Windows, and the web from a single codebase. Flutter was released in May 2017. Developers consider it as the fastest and most expressive way to c",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is Dart and Why does Flutter use it?",
    "answer_preview": "Dart is a programming language designed for client development, such as for the web and mobile apps. It is developed by Google and can also be used to build server and desktop applications. It is an object-oriented, class-based, garbage-collected language with C-style syntax.\n\n- Dart allows Flutter ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is `pubspec.yaml` file and what does it do?",
    "answer_preview": "Every Flutter project includes a `pubspec.yaml` file, which is generated while creating a new Flutter project. It's located at the top of the project tree and contains metadata about the project that the Dart and Flutter tooling needs to know.\n\nThe pubspec file specifies dependencies that the projec",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between `main()` and `runApp()` functions in Flutter?",
    "answer_preview": "The `main()` function tells Dart where the program starts, and it must be in the file that is considered the \"entry point\" for the program. By convention, this will be in a file called `main.dart`. This main function can execute any code within it's code block.\n\nThe `runApp()` function takes (as par",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between named parameters and positional parameters in Flutter.",
    "answer_preview": "A `Positional Parameter` is linked by its position. Positional parameters must be specified in the order in which they appear. `Named Parameters` are referenced by name, which means that they can be used during the function invocation in an order different from the function declaration.\n\nTo declare ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What are widgets in Flutter?",
    "answer_preview": "Widgets are the central class hierarchy in the Flutter framework, that describes the configuration of an element to manage the underlying render tree. A widget is an immutable description of part of a user interface. Widgets themselves have no mutable state, i.e., all their fields must be final.\n\nIn",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is `Hot Reload` and `Hot Restart` in Flutter?",
    "answer_preview": "Flutter's `Hot Reload` feature injects the updated source code files into the running **Dart Virtual Machine (VM)**, and rebuilds the widget tree preserving the app state to quickly view the effects of the changes.\n\nWhereas `Hot Restart` loads the updated source code files into the VM and restarts t",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by open-source software? Is Flutter open-source?",
    "answer_preview": "Open-source software is software with source code that anyone can inspect, modify, and enhance. Open-source software is developed in a decentralized and collaborative way, relying on peer review and community production. Open source software is often cheaper, more flexible, and has more longevity th",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between `StatelessWidget` and `StatefulWidget` in Flutter.",
    "answer_preview": "`StatelessWidget`s are those that do not change, or are immutable. Its appearance and properties remain constant throughout the widget's lifetime. **Icon**, **IconButton**, **Text** are examples of stateless widgets.\n\n`StatefulWidget`s are those that change their properties while running. They are d",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What are packages and plugins in Flutter?",
    "answer_preview": "A package only contains Dart code. Some of the packages may use Flutter specific functionality and thus have a dependency on the Flutter framework.\n\nA plugin contains Dart combined with one or more platform-specific native (Java/Swift/JavaScript) code. The API of the plugin is written in Dart and th",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "Name some popular apps made with Flutter.",
    "answer_preview": "- BMW\n- Google Pay\n- Alibaba\n- Beika\n- Dream11\n- eBay\n- Nubank\n- Reflectly\n- Rive\n- Toyota\n- Tencent\n- Hamilton\n- iRobot\n\n_Source: [Flutter Showcase](https://flutter.dev/showcase)_\n\n---",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between final, const and static keyword.",
    "answer_preview": "The `final` keyword defines a variable that can be initialized once and cannot be changed after being assigned a value for the first time.\n\nThe `const` keyword defines a constant variable that should not be changed over time.\n\nNow the only difference between the final and const variable is that **fi",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is Fat Arrow Notation in Dart?",
    "answer_preview": "A fat arrow (=>) is used to define a single expression in a function. This is a cleaner way to write functions with a single statement.\n\nSyntax:\n\n```\nReturnType FunctionName(Params) => Expression;\n```\n\nExample:\n\n```dart\n// Without fat arrow notation\nString findSquare(int n) {\n  return 'The square of",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of `SafeArea` widget in Flutter?",
    "answer_preview": "The `SafeArea` widget insets its child by sufficient padding to avoid intrusions by the operating system. For example, this will indent the child by enough to avoid the status bar at the top of the screen. It will also indent the child by the amount necessary to avoid the Notch, or similar creative ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between `mainAxisAlignment` and `crossAxisAlignment`.",
    "answer_preview": "The `mainAxisAlignment` determines how the children should be placed along the main axis in a flex layout. Whereas, the `crossAxisAlignment` determines how the children will be placed along the cross axis in a flex layout.\n\nFor a `Row` widget:\n- **mainAxisAlignment** --> Horizontal axis\n- **crossAxi",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between `Container` and `SizedBox` widget?",
    "answer_preview": "**SizedBox** is a widget for giving some constant height or width between two widgets. It does not contain any decorative properties just like color, shape, borderRadius etc.\n\nOn the other hand **Container** is a widget that any person can modify according to their needs.\n\nWhen used for whitespace, ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by Null-aware operators?",
    "answer_preview": "Null aware operator allows us to make computations based on whether or not a value is null.\n\nExample of null-aware operators are:\n\n- **Optional Chaining Operator (?.):**\n\n  We use ?. when we want to call a method/getter on an object if and only if that object is not null (otherwise, return null).\n\n ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is `TextEditingController`?",
    "answer_preview": "The `TextEditingController` is a class in the Flutter framework that provides control over the text in a text field. It allows you to read and modify the text, set the selection, and listen to changes to the text.\n\nIt is typically used in conjunction with a `TextField` widget to create an editable t",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is an `AspectRatio` widget used for?",
    "answer_preview": "The `AspectRatio` widget in Flutter is used to ensure that a widget maintains a specific aspect ratio, regardless of the size of the parent container. This can be useful in cases where you want a widget to have a specific shape, such as a square or a rectangle with a fixed width-to-height ratio.\n\nTh",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is `assert` used for in Dart and Flutter?",
    "answer_preview": "The `assert` is a statement in Dart and Flutter that checks if a boolean condition is true and triggers an exception if the condition is false. It is typically used for debugging purposes, as it is intended to be used in development only and will be ignored in a production environment.\n\nAn `assert` ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "How would you make HTTP requests in the Flutter framework?",
    "answer_preview": "Making HTTP requests in Flutter can be done using the `http` package. This package provides a simple API for sending HTTP requests and receiving HTTP responses.\n\nHere is an example of how to make a GET request to retrieve data from an API:\n\n```dart\nimport 'dart:convert';\nimport 'package:http/http.da",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What technology is Flutter built with?",
    "answer_preview": "Flutter is an open-source UI software development toolkit created by Google for building natively compiled applications across mobile, web, and desktop from a single codebase. It's primarily developed using the Dart programming language, also by Google, which supports ahead-of-time (AOT) compilation",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `initState()` method in a StatefulWidget?",
    "answer_preview": "The `initState()` method is a lifecycle method in the `StatefulWidget` class of the Flutter framework. It is called once when the stateful widget is first inserted into the widget tree and it is used to initialize the state of the widget.\n\nIn the `initState()` method, we can perform one-time initial",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `dispose()` method in a StatefulWidget?",
    "answer_preview": "The `dispose()` method is a lifecycle method in the `State` class of a `StatefulWidget` in the Flutter framework. It is called when the stateful widget is removed from the widget tree, giving us the opportunity to perform any cleanup tasks or release any resources that the widget may have used.\n\nIn ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between padding and margin in Flutter?",
    "answer_preview": "In Flutter, `padding` and `margin` are two properties used to adjust the spacing between widgets in the layout.\n\n- Padding is the amount of space added within a widget, between its content and its border. It affects the layout of the widget and increases the size of the widget. Padding is set using ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the scaffold widget in Flutter?",
    "answer_preview": "The `Scaffold` widget in Flutter is a basic structure or layout for a screen or a page in a Flutter application. It provides a visual structure for displaying a material design-style layout, which includes app bars, drawers, floating action buttons, and more.\n\nThe Scaffold widget serves as a contain",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the Expanded widget in Flutter?",
    "answer_preview": "In Flutter, the `Expanded` widget is used to adjust the available space for a child widget of a `Row`, `Column`, or `Flex` widget, by dividing the remaining free space among the children.\n\nWhen an `Expanded` widget is used, the child widget of the Row, Column, or Flex takes up as much available spac",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `SingleChildScrollView` widget in Flutter?",
    "answer_preview": "The `SingleChildScrollView` widget in Flutter is used to make its child widget scrollable if it overflows the parent container.\n\nThe purpose of `SingleChildScrollView` is to provide a way to display content that is larger than the available space. This widget is often used when a widget contains a l",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `Stack` widget in Flutter?",
    "answer_preview": "In Flutter, the `Stack` widget is used to place widgets on top of each other in a specific order. It allows to position widgets at specific locations within the parent widget by using offsets or alignment.\n\nThe main purpose of the `Stack` widget is to provide a way to overlay widgets on top of each ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is a `Theme` in Flutter?",
    "answer_preview": "In Flutter, a `Theme` is a widget that provides a way to customize the visual appearance of an app. A `Theme` widget can be used to set the colors, fonts, and other visual properties for a specific part or the entire app.\n\nUsing a `Theme` widget, we can define a set of colors, fonts, and other prope",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `Visibility` widget in Flutter?",
    "answer_preview": "In Flutter, the `Visibility` widget is used to control the visibility of a child widget based on a certain condition. The `Visibility` widget can be used to show or hide a widget dynamically, based on user interactions or other conditions.\n\nThe `Visibility` widget has a visible property that determi",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "How do you navigate between screens in Flutter?",
    "answer_preview": "In Flutter, we can navigate between screens using the `Navigator` class. We can push a new screen onto the stack using the `push` method, and pop the current screen off the stack using the `pop` method. We can also use named routes to navigate between screens. To do this, we need to define a map of ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is a modal bottom sheet in Flutter?",
    "answer_preview": "In Flutter, a modal bottom sheet is a type of popup that is displayed at the bottom of the screen and covers a portion of the parent widget. Modal bottom sheets are commonly used to display additional options or information that are related to the parent widget, but require additional user input to ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "How do you use the `Positioned` widget in Flutter?",
    "answer_preview": "In Flutter, the `Positioned` widget is used to position a child widget within a `Stack` widget. The `Positioned` widget takes four optional arguments: `left`, `top`, `right`, and `bottom`, which specify the position of the child widget relative to the edges of the parent `Stack` widget.\n\nFor example",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "How do you pass data between screens in Flutter?",
    "answer_preview": "In Flutter, we can pass data between screens using various methods. Some of the most commonly used methods are:\n\n1. **Using constructor parameters**: We can pass data between screens by passing the required data as parameters to the constructor of the destination screen.\n\n   ```dart\n   Navigator.pus",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `Navigator` class in Flutter?",
    "answer_preview": "In Flutter, the `Navigator` class is used to manage a stack of pages or routes in an app. It provides methods to push and pop routes onto and off of the stack, allowing the user to navigate between different screens or views within the app.\n\nHere are some of the key features and use cases of the `Na",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the `FittedBox` widget in Flutter?",
    "answer_preview": "The `FittedBox` widget in Flutter is used to automatically scale and position its child within its own bounds. The purpose of the `FittedBox` widget is to provide an easy-to-use way to adjust the size and position of a child widget to fit within its parent widget. When using the `FittedBox`, we can ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between Cupertino and Material Design in Flutter?",
    "answer_preview": "Cupertino and Material Design are two design languages used in Flutter for building iOS and Android apps, respectively. While both design languages follow different design principles and have unique features, they share some similarities as well.\n\nHere are some of the main differences between Cupert",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of the Material Design Icons package in Flutter?",
    "answer_preview": "The Material Design Icons package in Flutter provides a set of icons that follow the Material Design guidelines for iconography. These icons are designed to be simple, easy to recognize, and scalable, making them ideal for use in mobile apps and web applications.\n\nThe Material Design Icons package c",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "How do Object, dynamic, and var differ in Dart?",
    "answer_preview": "In Dart, Object, dynamic, and var are used for variable declarations but differ in how types are handled:\n\n**Object:** The base class for all types in Dart. Variables declared as Object can hold any type of value, but you need to explicitly cast them when accessing methods or properties specific to ",
    "source": "GITHUB",
    "difficulty": "basic"
  },
  {
    "question": "Tell me about Flutter Provider.",
    "answer_preview": "INTERMEDIATE\n\nWidgets are used to build the provider. Inside the provider, one can use all the objects as if they are a part of it with the new widget subclasses it creates. Primarily, it works on the concept of **PUB-SUB** which means one provider with many subscribers.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the advantages of using Flutter?",
    "answer_preview": "INTERMEDIATE\n\nFlutter has many advantages:\n\n- **Fast development**: With the help of Flutter, you can save a lot of time while developing software. Hot reload is a flutter feature with which you can make changes to your code and see the results in real time.\n- **Flexible user interface**: Flutter pr",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the Navigator in Flutter and how is it used?",
    "answer_preview": "INTERMEDIATE\n\n**Navigator** is a widget in Flutter that manages a stack of screens or \"routes\" in an application. It is used to navigate between different screens and to manage the state of the navigation stack. Navigator is typically used in conjunction with MaterialApp or CupertinoApp to create a ",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you tell us some examples of App State?",
    "answer_preview": "INTERMEDIATE\n\nSome examples of App State include:\n\n- Login info\n- Notifications in a social networking app\n- User preferences\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Explain Streams in Flutter?",
    "answer_preview": "INTERMEDIATE\n\n**Future** and **Stream** are classes in Dart that define asynchronous programming. It behaves asynchronously as it doesn't return the next event when requested. Instead, it informs when the next event will be returned when ready.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the lifecycle of a StatefulWidget?",
    "answer_preview": "INTERMEDIATE\n\nA StatefulWidget's lifecycle is as follows:\n\n1. `createState`\n2. `initState`\n3. `didChangeDependencies`\n4. `build`\n5. `didUpdateWidget`\n6. `setState`\n7. `deactivate`\n8. `dispose`\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Define the term Cookbook.",
    "answer_preview": "INTERMEDIATE\n\nA **cookbook** provides specific programming solutions for some common problems experienced by developers during the development process. Each recipe can be used independently during the development process.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What do you mean by Container class?",
    "answer_preview": "INTERMEDIATE\n\nThe **container class** is the convenience widget that enables positioning, sizing, and painting of widgets. A container class can include multiple widgets and it enables developers to manage those widgets according to their convenience.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What is Flutter Architecture?",
    "answer_preview": "INTERMEDIATE\n\nFlutter architecture is comprised of three layers:\n\n### Flutter Framework Layer\nThis is the highest layer in the Flutter architecture and includes the widgets and the Material Design widgets. It also includes APIs for animations, gestures, and routing.\n\n### Engine Layer\nThis is the cor",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you give some reasons why Flutter is better than its alternatives?",
    "answer_preview": "INTERMEDIATE\n\nFlutter has several advantages over its alternatives. Here are some of the main reasons why Flutter is a great choice for building mobile apps:\n\n- Flutter offers a **hot-reload feature** that enables developers to see changes in their code instantly without having to wait for the app t",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Explain how you will deploy a Flutter app to the Google Play/App Store?",
    "answer_preview": "INTERMEDIATE\n\nFor deploying Flutter apps to the Google Play Store or App Store, you will need to know the guidelines suggested by each. In both cases, it's important to make sure your app meets the requirements and guidelines of the respective app store before submitting it for review. This includes",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Explain the Primary Axis and Cross Axis Alignment.",
    "answer_preview": "INTERMEDIATE\n\nAn alignment defines how a row or a column is aligned with respect to the horizontal or vertical axis. For example, for a row its main axis is horizontal and so its cross axis will be vertical.\n\n- **PrimaryAxisAlignment**: the rows run horizontally, and the columns run vertically.\n- **",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you tell us a way to access screen size in the future?",
    "answer_preview": "INTERMEDIATE\n\nYou can access the screen size using the **MediaQuery** class. The MediaQuery class provides information about the current device's screen size and orientation.\n\n```dart\nfinal size = MediaQuery.of(context).size;\nfinal width = size.width;\nfinal height = size.height;\n```\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What's the difference between container and sizedBox?",
    "answer_preview": "INTERMEDIATE\n\nContainer and SizedBox are both widgets in Flutter that can be used to size and position child widgets, but they have some differences.\n\nThe **Container** widget is a multi-purpose widget that can be used to apply decoration, padding, margin, and constraints to a child widget. The Cont",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "When do you use release mode and what's the function of release mode?",
    "answer_preview": "INTERMEDIATE\n\nA **release mode** is used when one needs to optimize and produce the codes without any debug data. The release mode is used for deploying the app.\n\nThe command used to compile the release mode is:\n```bash\nflutter run --release\n```\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you name some popular database packages in Flutter?",
    "answer_preview": "INTERMEDIATE\n\nHere are two widely used packages in Flutter:\n\n- **Firebase**: It is used to use or modify the cloud database\n- **Sqflite**: It is used to modify the SQLite database\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the advantages of a Flutter Inspector?",
    "answer_preview": "INTERMEDIATE\n\nThe advantages of Flutter inspector are as follows:\n\n- **Widget mode**: With this button, you can choose different widgets from your application and inspect them one at a time. After choosing any Widget from the Widget Tree you can view the blueprint of that Widget with the help of the",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Define factory constructors.",
    "answer_preview": "INTERMEDIATE\n\nA **factory constructor** invokes another constructor, which is allowed to return an instance of a derived class, null or an existing instance. Factory constructors are defined using the `factory` keyword.\n\n```dart\nclass Logger {\n  static final Map<String, Logger> _cache = {};\n\n  facto",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "List the responsibilities of FlutterActivity.",
    "answer_preview": "INTERMEDIATE\n\nThe roles of a **FlutterActivity** are:\n\n- Configuring the appearance of the status bar\n- Displaying Android launch screen\n- Displaying flutter splash screen\n- Choosing an execution path for the Dart app bundle\n- Adding transparency, which is an optional responsibility\n- Saving and res",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Name the different types of grid view in Flutter.",
    "answer_preview": "INTERMEDIATE\n\nThe different types of grid views in Flutter are:\n\n- `GridView.count()`\n- `GridView.custom()`\n- `GridView.builder()`\n- `GridView.extent()`\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "How would you implement a custom transition between screens in Flutter?",
    "answer_preview": "INTERMEDIATE\n\nYou can use the **PageRouteBuilder** class to create custom transitions between screens. This class allows you to define custom animations, such as sliding or fading, for the page transition.\n\n```dart\nNavigator.push(\n  context,\n  PageRouteBuilder(\n    pageBuilder: (context, animation, ",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you explain how to use the Provider package for state management in Flutter?",
    "answer_preview": "INTERMEDIATE\n\nThe **Provider** package is a state management library that allows you to share data between widgets efficiently. You can use the Provider package to create a data model, expose it using a provider, and then access it in your widgets using the `Provider.of` method.\n\n```dart\n// Create a",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between Expanded and Flexible?",
    "answer_preview": "INTERMEDIATE\n\n**Flexible** takes the least space needed to fit in a child widget. On the other hand, **Expanded** takes the rest of the size in the widget.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you tell us some differences between const and final in Flutter?",
    "answer_preview": "INTERMEDIATE\n\nThe only difference between `const` and `final` is that the **const variables are evaluated at compile-time** and are immutable whereas **final variables are evaluated at runtime** and can only be set once.\n\n```dart\nfinal currentTime = DateTime.now(); // Runtime value\nconst pi = 3.1415",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "How would you optimize the performance of a Flutter app?",
    "answer_preview": "INTERMEDIATE\n\nSome techniques to optimize the performance of a Flutter app include:\n\n- Using the `const` keyword to make widgets immutable\n- Avoiding unnecessary widget rebuilds\n- Using the Provider package for efficient state management\n- Minimizing the number of expensive operations in the build m",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you describe how to implement internationalization in a Flutter app?",
    "answer_preview": "INTERMEDIATE\n\nFlutter provides the **Intl** package, which allows you to add support for multiple languages to your app. You can use the package to define messages in different languages, format numbers, dates, and times, and apply pluralization rules based on the language.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Differentiate between setState and Provider?",
    "answer_preview": "INTERMEDIATE\n\nThe `setState()` is used for managing the **local state**. Calling the setState() function notifies the framework about the change in the state of the object and that may affect the user interaction in the subtree.\n\nWhereas, **provider** is a state management technique in Flutter that ",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Is it possible to nest a Scaffold? Why or why not?",
    "answer_preview": "INTERMEDIATE\n\n**Yes, it is possible.** Scaffold is a widget, so you can put it anywhere you want. Scaffold provides APIs like Drawer, SnackBar, BottomNavigationBar, FloatingActionButton, etc. However, it is not necessary to nest scaffolds as they can be used on their own.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you explain how to use streams and futures in Flutter? Also, tell us some similarities and differences between Future and Stream?",
    "answer_preview": "INTERMEDIATE\n\nStreams and futures are powerful tools for handling asynchronous operations in Flutter. You can use a **stream** to listen for a series of events, such as user input or network responses, and react to them in real-time. A **future**, on the other hand, represents a value that may not b",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you tell us the difference between WidgetsApp and MaterialApp?",
    "answer_preview": "INTERMEDIATE\n\nThe main difference between **WidgetsApp** and **MaterialApp** is that the widget offers basic navigation, whereas MaterialApp is built on top of WidgetsApp.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Can you state some difference between runApp() and main()?",
    "answer_preview": "INTERMEDIATE\n\n**Main()**: Main() function starts the program. You cannot write a program in Flutter without using the main() function.\n\n**runApp()**: runApp() is used to launch the software. RunApp() allows you to return the widgets that are connected to the screen as the widget tree's root.\n\n```dar",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "What's the need of mixins?",
    "answer_preview": "INTERMEDIATE\n\n**Multiple inheritances are not supported in Dart.** Hence, you would need **mixins** to use multiple inheritance in Flutter, as they allow you to write reusable class code in multiple class hierarchies.\n\n```dart\nmixin Musical {\n  void playInstrument() {\n    print('Playing music');\n  }",
    "source": "TURING-QUESTIONS",
    "difficulty": "intermediate"
  },
  {
    "question": "Why is Flutter preferred over other mobile app developing tools?",
    "answer_preview": "BASIC\n\nFlutter is a free and open-source mobile UI framework, introduced by Google in May 2017. Flutter enables you to develop a native mobile app using only one codebase. This implies you may design two separate apps using the same programming language and codebase (for iOS and Android).\n\nFlutter i",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What are packages and plugins in Flutter?",
    "answer_preview": "BASIC\n\nA **package** is a set of classes, interfaces, and sub-packages that allow users to create modular code that can be shared easily. Instead of starting from scratch, using packages can help construct applications fast. In Flutter, you may use a package to add new widgets or functionality to an",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What are the limitations of Flutter?",
    "answer_preview": "BASIC\n\nSince Flutter is still a relatively new tool, it has some limitations. They are as follows:\n\n- The number of third-party libraries is very small\n- The release size of Flutter is larger than expected\n- Flutter requires to be used along with another OOP language, Dart which cannot compete with ",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Why does it generally take a long time to develop a Flutter app?",
    "answer_preview": "BASIC\n\nBecause Flutter generates a device-specific IPA or APK file, building a Flutter application takes substantially longer the first time. This method, which normally takes a long time, uses Xcode and Gradle to build a file.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What are keys and how do you use them?",
    "answer_preview": "BASIC\n\nA set of IDs for Widgets, Elements and SemanticsNodes make up the key class. Keys are responsible for preserving the state of widgets when they are updated inside the widget tree. Keys may also be used to modify and rearrange collections of widgets of the same type and defined states.\n\nOtherw",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What are the different types of streams in Dart?",
    "answer_preview": "BASIC\n\nStreams provide an asynchronous sequence of data. Asynchronous programming uses the idea of streams. They refer to a program's asynchronous succession of data occurrences. We put a value on one end and a listener on the other, similar to a pipe. Several listeners can be combined into a single",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What is pubspec.yaml file?",
    "answer_preview": "BASIC\n\nWhile creating a Flutter project, a particular type of file is always included at the top of the project. This file is known as the pubspec.yaml file, also called 'pubspec'. This file contains information about a project's dependencies, such as packages and their versions, typefaces, and so o",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What is Flutter?",
    "answer_preview": "BASIC\n\nFlutter is an open source software development kit (SDK) UI used for cross-platform applications from a single codebase. Flutter is primarily used for creating natively compiled, multi-platform applications across iOS and Android seamlessly.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Flutter is developed by which company?",
    "answer_preview": "BASIC\n\n**Google**\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What was the first version of Flutter which ran on an Android operating system?",
    "answer_preview": "BASIC\n\n**Sky** is the first version of Flutter which ran on Android OS. It was announced at the 2015 Dart developer summit with the stated goal of being able to render consistently at 120 frames per second.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us the four main elements of Flutter?",
    "answer_preview": "BASIC\n\nThe four main elements of Flutter are:\n\n1. Flutter engine\n2. Widgets\n3. Design-specific widgets\n4. Foundation Library\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "When was the first version of Flutter released?",
    "answer_preview": "BASIC\n\nThe first version of Flutter was released in **May 2017**, but it was first announced in 2015. In December 2018, Google released Flutter 1.0. In December 2019, Flutter 1.12 was released.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Flutter is written in which language?",
    "answer_preview": "BASIC\n\nFlutter was written in the **Dart language**. While writing and debugging an application, Flutter runs in the Dart virtual machine, which features a just-in-time execution engine.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What does the acronym SDK stand for?",
    "answer_preview": "BASIC\n\n**Software Development Kit** is a set of software tools and programs provided by software and hardware vendors that developers can use to develop applications for specific platforms. An SDK helps developers easily integrate their apps with a vendor's services. SDKs can include APIs (Applicati",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you name some best editors for Flutter development?",
    "answer_preview": "BASIC\n\nSome popular IDEs (Integrated Development Environment) for Flutter include the following:\n\n- Android Studio\n- IntelliJ Idea\n- Emac\n- Visual Studio\n- Codemagic\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Which operator is used to evaluate and return values between two expressions?",
    "answer_preview": "BASIC\n\nThe **`??` operator** is used to evaluate and return values between two expressions. This operator first checks the expression 1 and, if it is non-null, returns its value; otherwise, it will evaluate and return the value of expression 2.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us how many kinds of widgets there are in Flutter?",
    "answer_preview": "BASIC\n\nThere are two main types of widgets in Flutter. These include:\n\n**StatelessWidget** - It does not have any state information. It is static throughout its lifecycle. Examples are Row, Text, Column, and Container.\n\n**StatefulWidget** - It has state information. It contains two classes: the stat",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you name the command used to compile the release mode?",
    "answer_preview": "BASIC\n\nThe command `flutter run --release` is used to compile the release mode. Release mode for a web app means that the app is compiled with the dart2js compiler for best performance.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Name the different types of build modes in Flutter.",
    "answer_preview": "BASIC\n\nThere are three types of build modes in Flutter:\n\n**Debug** - It is used to test the apps. On Android Studio, you can find a green play button on the top panel.\n```bash\nflutter run\n```\n\n**Profile** - In this mode, some debugging ability is maintained - enough to profile your app's performance",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Which widget in Flutter is a box that comes with a different size?",
    "answer_preview": "BASIC\n\n**SizedBox** is a widget in Flutter that allows us to specify an arbitrary size for a widget. It is basically used to add empty space between widgets. SizedBox also supports specifying a specific aspect ratio for its child.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Suppose you have to represent real world behavior in Flutter, which animation would you use?",
    "answer_preview": "BASIC\n\nThe choice of animation in Flutter would depend on the specific behavior that needs to be represented. Flutter provides several animation options that can be used to represent real-world behavior. These include:\n\n- Physics-based animation\n- Tween animation\n- Curved animation\n- Hero animation\n",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Name some popular apps that use Flutter.",
    "answer_preview": "BASIC\n\nSome of the most popular apps that employ Flutter include:\n\n- Google Ads\n- Hamilton\n- KlasterMe\n- Reflectly\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Which folder is used to write Android apps in Flutter?",
    "answer_preview": "BASIC\n\n**Android Folder** is used to write Android apps in Flutter. The Android Folder contains files and folders required for running the application, and these files are autogenerated during the creation of a Flutter project.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What is the use of the Await function?",
    "answer_preview": "BASIC\n\nThe **Await** function is an asynchronous function. Its job is to wait until it gets the final value. Await is used with async functions and that run asynchronously, giving users the choice to wait for the asynchronous mode to finish before continuing.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us which function compiles and updates the app?",
    "answer_preview": "BASIC\n\nIn Flutter, there are several functions and commands that can be used to compile and update the app. However, the most commonly used function for this purpose is **hot reload**.\n\nHot reload is a development feature in Flutter that allows you to update your app's code in real-time, without res",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell which function is accountable for starting the program?",
    "answer_preview": "BASIC\n\n**main()** function is used to start a program. This function is highly critical as, without it, one cannot write any function.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of animation controller class in Flutter?",
    "answer_preview": "BASIC\n\nThe **Animation Controller** class in Flutter is used to control and manage animations. It provides a way to start, stop, or pause an animation, and allows you to define the duration, speed, and direction of an animation.\n\nThe primary purpose of the Animation Controller class is to define an ",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "How can you test a single Widget?",
    "answer_preview": "BASIC\n\nUsing the **Widget tests** technique, you can make sure that various portions of the user interface work as intended without the need for a physical device or simulator. This technique is the best way to isolate small parts of your app and find out whether your code is behaving as expected.\n\n",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you use WidgetsApp for basic navigation?",
    "answer_preview": "BASIC\n\nYes, a material app widget builds a navigator, which manages a stack of widgets identified by strings, also known as routes objects and gives you two ways for managing the stack.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Which widget allows us to refresh the screen?",
    "answer_preview": "BASIC\n\n**RefreshIndicator Widget** enables us to refresh the screen. When the user pulls down on the widget, the onRefresh callback is triggered, which typically involves fetching new data from a server or updating the UI in some way.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you state a few examples of stateless widget?",
    "answer_preview": "BASIC\n\nSome examples of a stateless widget include the following:\n\n- **Text** - This displays a string of text with a single style.\n- **Container** - This widget can contain other widgets and provide padding, margins, and other layout properties.\n- **Icon** - This is used for the list of available m",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Explain the term \"Tree shaking\" in Flutter.",
    "answer_preview": "BASIC\n\n**Tree shaking** is a method of removing the unused module in the bundle during the development process. Tree shaking serves as a sort of optimization technique that optimizes the code by removing the dead code.\n\nWhile importing or exporting codes, there might be dead codes hanging around. Re",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What is used to import packages for your project?",
    "answer_preview": "BASIC\n\n**pubspec.yaml** file is used to import packages in the Dart code. It allows us to set the constraints for the application. This file contains project dependencies, general project settings, and project assets.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What's the use of Navigation.push in Flutter?",
    "answer_preview": "BASIC\n\nThe role of **Navigation.push** in Flutter is to add a route to a bundle of other routes which are managed by the navigator.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Why HTTP package is used in Flutter?",
    "answer_preview": "BASIC\n\n**HTTP package** is used in Flutter for making HTTP requests to web servers. It allows Flutter developers to send HTTP requests and receive HTTP responses from APIs or web servers. Flutter apps need to communicate with APIs or web servers to fetch data or send data to the server. The HTTP pac",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Explain profile mode in Flutter?",
    "answer_preview": "BASIC\n\nThe **profile mode** in Flutter is used to test the functionality of an app while launching it. It compiles and launches your app almost identically to release mode but with additional functionality to allow debugging performance problems.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What's the role of BuildContext in Flutter?",
    "answer_preview": "BASIC\n\nIn Flutter, the **BuildContext** is an object that provides access to the location of a widget in the widget tree hierarchy and to various services such as Theme, MediaQuery, and Navigator. The BuildContext is used by widgets to access the properties of their parent widget, such as its size, ",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us which class is responsible for implementing the basic material design visual layout structure for an app in Flutter?",
    "answer_preview": "BASIC\n\nThe **scaffold class** is a widget in Flutter that is used to implement the basic material design visual layout structure. The scaffold class makes it faster to create a general-purpose mobile application. Moreover, it contains almost everything we need to create a functional and responsive F",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us what will be the default return type, if you don't specify the return type for a function?",
    "answer_preview": "BASIC\n\nIn Flutter, Dart is the programming language used to develop the framework. In Dart, if you don't specify the return type for a function, the default return type will be **dynamic**. This means, if you declare a function in Flutter without specifying a return type, Dart assumes that the funct",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What's the name of a constructor for a class in Flutter?",
    "answer_preview": "BASIC\n\nThe name of a constructor for a class is **the same as that of the class itself**. Constructor is a special strategy that is used to create objects with predetermined values for the properties. There are three types of constructors in Flutter: named constructor, standard constructor, and fact",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What's the core of the Flutter layout mechanism?",
    "answer_preview": "BASIC\n\nThe main core of the Flutter layout mechanism is the **Widgets**. The widgets are the building blocks of the user interface, and they are arranged in a tree-like structure known as the widget tree. The image, text, icon, and even the layout of your application are all widgets.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Which widget can be used to display one after another in scroll format?",
    "answer_preview": "BASIC\n\nThe **ListView Widget** is used to display a large number of items as a scrollable list. ListView is an advanced version of the Column widget that automatically provides scrolling when the list of items won't fit on the screen.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What is a layout in Flutter?",
    "answer_preview": "BASIC\n\nA **layout** in Flutter refers to how widgets are arranged on the screen. The layout is determined by the constraints passed down from the parent widget, and it determines the position and size of the child widget.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us how we can test a single widget in Flutter?",
    "answer_preview": "BASIC\n\n**Widget tests** allow building and interacting with widgets in a test environment. It is used to check whether the Widget works as expected or not. Hence, using this testing UI component, you can test a single widget.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What's the latest version of Flutter?",
    "answer_preview": "BASIC\n\n**3.7** is the latest version of Flutter (as of the time of writing). Along with an improved framework, this new version also has great new features like enhanced material 3 support, cascading menus and menu bars, impeller preview, custom context menus, and DevTools updates among others.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Is Flutter a front-end framework or back-end?",
    "answer_preview": "BASIC\n\nFlutter is primarily a **front-end framework**. It provides tools and widgets to build beautiful and engaging user interfaces, and it supports various platforms such as iOS, Android, and the web. However, the framework does provide some back-end functionalities. Flutter applications can commu",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What's the function of the future in Dart?",
    "answer_preview": "BASIC\n\nA **future** function is used to predict a potential error or value that may occur in the future. It can be completed with a value or an error. Here, developers can plug callbacks for each case. Some programming languages use \"promise\" for the same function.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What's the role of image.network() constructor in Flutter?",
    "answer_preview": "BASIC\n\nThe **Image.network()** constructor is a widget in Flutter that allows you to display images from the network in your application. It is used to load and display images from a URL.\n\n**Example:**\n```dart\nImage.network('https://picsum.photos/250?image=9')\n```\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us what you know about Rune In Dart?",
    "answer_preview": "BASIC\n\nIn dart programming language strings are a sequence of UTF-16 which is a 16 bit unicode Transformation Format. **Rune** refers to an integer that is used to describe any Unicode code point.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Is Flutter free?",
    "answer_preview": "BASIC\n\n**Yes.** It is a free and open source mobile UI framework created by Google. Here, with only one codebase, you can create native mobile applications.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Why do we use const keyword in Flutter?",
    "answer_preview": "BASIC\n\nWe use the **const** keyword to declare constants. Basically, when we know the value of a variable at compile time. This means the compiler knows in advance what value to store.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What are some operators commonly used in Dart?",
    "answer_preview": "BASIC\n\nHere are some of the operators that are commonly used to build apps in Dart:\n\n- **`=`** (assignment operator): Used to assign a value to a variable.\n- **`??`** (null-aware operator): Used to check whether a variable is null or not and provide a default value if it is null.\n- **`!`** (bang ope",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Why do we use a ticker in Flutter?",
    "answer_preview": "BASIC\n\n**Tickers** are used in Flutter as they provide a secure way of updating the UI at 60 frames per second. It is a class that listens to the frameCallback and calls a tick function that forwards the elapsed duration between the current frame and last frame to the ticker listener.\n\n---",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "How can you reduce execution time for running code?",
    "answer_preview": "BASIC\n\nIt will depend on the size and adaptability of the app packages. According to which we can integrate just-in-time compilers to run code which will enhance the app's performance. Dart code execution is faster than many other languages where Ahead-of-time compilers also shorten execution times.",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What is Dart?",
    "answer_preview": "BASIC\n\n**Dart** is a general-purpose, object-oriented programming language that was initially developed by Google in 2011. It is designed to be fast, efficient, and scalable, making it ideal for building a wide range of applications, including web and mobile apps, server-side applications, and comma",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "What process will you use to reduce widget rebuild?",
    "answer_preview": "BASIC\n\nOn rebuilding, the state of the widget changes. This, however, helps the user to see the UI reflect state changes. At this point recreating sections of the user interface that do not need to be changed is unnecessary.\n\nTo avoid the needless rebuilding of the widgets one can divide the widget ",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Define spacer widget?",
    "answer_preview": "BASIC\n\nIn Flutter, the **Spacer widget** is a flexible widget that takes up available space within a Row, Column, or Flex layout. It is commonly used to create vertical or horizontal space between widgets, or to distribute available space between multiple widgets.\n\n---\n\n> **Note:**\n  **Completed!** ",
    "source": "TURING-QUESTIONS",
    "difficulty": "basic"
  },
  {
    "question": "Flutter Vs React: Which is better?",
    "answer_preview": "ADVANCED\n\nIt's difficult to decide which framework to choose as they both are exceptionally good and loved by companies and developers. However, you can pick one based on your particular needs.\n\n### Flutter Advantages:\n- Single codebase for iOS, Android, Web, Desktop\n- Hot reload for faster developm",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "Why do we need separate directories for iOS and Android in Flutter?",
    "answer_preview": "ADVANCED\n\nHere's why you would need two different directories for Android and iOS files in Flutter:\n\n### Android Folder\nYou need an Android folder to keep files of an Android project. When any Flutter framework creates the code, the compiler converts the Flutter code into native code that is then im",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "Can you explain how to use Flutter's built-in navigation system to create a multi-level navigation hierarchy?",
    "answer_preview": "ADVANCED\n\nFlutter's navigation system allows you to create a multi-level navigation hierarchy by using the **Navigator** widget to manage a stack of pages. You can push new pages onto the stack using the `Navigator.push` method and remove them using the `Navigator.pop` method.\n\n```dart\n// Push a new",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe how to use Flutter's gesture recognition system to detect user input?",
    "answer_preview": "ADVANCED\n\nFlutter's gesture recognition system provides a set of pre-defined gestures, such as tap, drag, and scale, that allow you to detect user input and react to it. You can use the **GestureDetector** widget to listen for gestures and the `GestureDetector.onTap` method to handle taps. You can a",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "How would you create a custom widget in Flutter, and what are the benefits of doing so?",
    "answer_preview": "ADVANCED\n\nTo create a custom widget in Flutter, you need to create a new class that extends either **StatefulWidget** or **StatelessWidget**, depending on whether your widget needs to be stateful or not.\n\n### Benefits of creating custom widgets:\n\n1. **Reusability**: Use the same widget across multip",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "What is the difference between hot reload and hot restart?",
    "answer_preview": "ADVANCED\n\n### Hot Reload\n\nIn Flutter, **Hot Reload** is the easiest and quickest way to make any changes, create UIs, fix bugs, and add features to the app. A Hot Reload performs all these changes rapidly and makes changes in the UI without disturbing the entire app.\n\n**How to perform Hot Reload:**\n",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe how to use the Flutter animations API to create custom animations?",
    "answer_preview": "ADVANCED\n\nThe Flutter animations API provides a set of classes and widgets that allow you to create custom animations, such as tween animations or physics-based animations. You can use the **AnimationController** class to manage the animation's state, and the **Tween** class to define the animation'",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "Can you describe in detail the Flutter IDEs?",
    "answer_preview": "ADVANCED\n\nSome of the most popular Flutter IDEs include the following:\n\n### IntelliJ IDEA\n**IntelliJ IDEA** is feature-rich, boasts extensive support for many languages, and provides smart coding assistance. Most beginner developers would probably get by with the free Community Edition, but the paid",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a custom transition between screens in Flutter?",
    "answer_preview": "ADVANCED\n\nTo implement a custom transition between screens, you can use the **PageRouteBuilder** class and provide a custom `transitionsBuilder` function.\n\n**For example, to create a fade transition:**\n\n```dart\nclass FadeRoute extends PageRouteBuilder {\n  final Widget page;\n\n  FadeRoute({required th",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a draggable widget in Flutter?",
    "answer_preview": "ADVANCED\n\nTo implement a draggable widget in Flutter, you can use the **Draggable** and **DragTarget** widgets.\n\n**Example: Create a draggable widget that can be dropped onto a specific target:**\n\n```dart\nclass DraggableExample extends StatefulWidget {\n  @override\n  _DraggableExampleState createStat",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "How do you implement a custom animation curve in Flutter?",
    "answer_preview": "ADVANCED\n\nTo implement a custom animation curve in Flutter, you can create a class that extends the **Curve** class and provide a custom implementation of the `transform` method.\n\n**Example: Create a bounce-in curve:**\n\n```dart\nclass BounceInCurve extends Curve {\n  @override\n  double transform(doubl",
    "source": "TURING-QUESTIONS",
    "difficulty": "advanced"
  },
  {
    "question": "What is Flutter?",
    "answer_preview": "Flutter is an open-source, cross-platform application development framework that allows developers to create high-performance, beautiful, responsive applications for multiple platforms like Android, iOS, Linux, Mac, Windows, and the web using a single codebase. It is unique from other mobile app dev",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What is Dart, and why is it used in Flutter?",
    "answer_preview": "Dart is a client-side programming language that is used in Flutter for developing applications for multiple platforms like Android, iOS, Linux, Mac, Windows, and the web. Dart is used in Flutter because of the following reasons:\n\n- Dart is optimized for client-side development, which makes it perfec",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What are the different types of widgets in Flutter?",
    "answer_preview": "In Flutter, widgets are the building blocks for creating UI elements. There are two types of widgets in Flutter:\n\n**Stateless widgets:** These widgets are immutable, meaning they cannot be changed once they are created. Stateless Widget are used when the UI elements do not need to be redrawn or upda",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between StatelessWidget and StatefulWidget in Flutter?",
    "answer_preview": "In Flutter, StatelessWidget and StatefulWidget are two different types of widgets that are used to create UI elements.\n\n| StatelessWidget | StatefulWidget |\n|-----------------|----------------|\n| StatelessWidget is a widget that does not have any mutable state | StatefulWidget is a widget that has a",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of a key in Flutter?",
    "answer_preview": "In Flutter, a **Key** is an object that identifies a widget. It is used to maintain the state of the widget and to optimize the rendering performance of the app.\n\nWhen a widget is built, Flutter assigns a unique identity to it based on its location in the widget tree. However, when the widget tree i",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between MaterialApp and WidgetsApp in Flutter?",
    "answer_preview": "| MaterialApp | WidgetsApp |\n|-------------|------------|\n| Used for creating applications that follow the Material Design guidelines | Used for creating applications that do not follow the Material Design guidelines |\n| Provides pre-built widgets like AppBar, BottomNavigationBar, FloatingActionButt",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What are some common Flutter performance optimization techniques?",
    "answer_preview": "Flutter provides many tools and techniques for optimizing the performance of your application:\n\n- **Minimizing widget rebuilds**: Use the `const` and `final` keywords for widgets that don't change\n- **Reducing the size of widgets**: Use SizedBox to create empty space and Spacer to fill space\n- **Usi",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between Navigator and Router in Flutter?",
    "answer_preview": "| Navigator | Router |\n|-----------|--------|\n| Widget used to manage the navigation stack | More flexible and powerful way of managing navigation |\n| Allows back and forth navigation using back button or gestures | Allows custom transition animations and complex navigation flows |\n| Simple and easy",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What is State in Flutter?",
    "answer_preview": "In Flutter, state refers to the data or information that can change dynamically during the lifetime of a widget. Widgets are the building blocks of a Flutter app, and they can be either stateful or stateless.\n\n- Stateful widgets maintain state information and can update their state when required\n- T",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "What is the purpose of setState() in Flutter?",
    "answer_preview": "`setState()` is a method that is used to update the state of a Stateful widget in Flutter. When a widget is updated, the Flutter framework calls the `build()` method of the widget to rebuild its UI based on the new state.\n\n### How setState() works:\n\n1. The `setState()` method tells the Flutter frame",
    "source": "GEEKSFORGEEKS",
    "difficulty": "basic"
  },
  {
    "question": "Can you describe how to implement internationalization in a Flutter app?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter provides the **Intl** package, which allows you to add support for multiple languages to your app. You can use the package to define messages in different languages, format numbers, dates, and times, and apply pluralization rules based on the language.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you explain how to use streams and futures in Flutter? Also, tell us some similarities and differences between Future and Stream?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nStreams and futures are powerful tools for handling asynchronous operations in Flutter. You can use a **stream** to listen for a series of events, such as user input or network responses, and react to them in real-time. A **future**, on the other hand, represents a value that ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you explain how to use the Provider package for state management in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **Provider** package is a state management library that allows you to share data between widgets efficiently. You can use the Provider package to create a data model, expose it using a provider, and then access it in your widgets using the `Provider.of` method.\n\n```dart\n//",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you explain the process of creating custom widgets in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe process of creating custom widgets in Flutter involves the following steps:\n\n1. **Extend the `StatelessWidget` or `StatefulWidget` class**: To create a custom widget, we need to extend the `StatelessWidget` or `StatefulWidget` class, depending on whether the widget is stateless or ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you give some reasons why Flutter is better than its alternatives?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter has several advantages over its alternatives. Here are some of the main reasons why Flutter is a great choice for building mobile apps:\n\n- Flutter offers a **hot-reload feature** that enables developers to see changes in their code instantly without having to wait for ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you name some popular database packages in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nHere are two widely used packages in Flutter:\n\n- **Firebase**: It is used to use or modify the cloud database\n- **Sqflite**: It is used to modify the SQLite database\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you state some difference between runApp() and main()?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Main()**: Main() function starts the program. You cannot write a program in Flutter without using the main() function.\n\n**runApp()**: runApp() is used to launch the software. RunApp() allows you to return the widgets that are connected to the screen as the widget tree's root",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us a way to access screen size in the future?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nYou can access the screen size using the **MediaQuery** class. The MediaQuery class provides information about the current device's screen size and orientation.\n\n```dart\nfinal size = MediaQuery.of(context).size;\nfinal width = size.width;\nfinal height = size.height;\n```\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us some differences between const and final in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe only difference between `const` and `final` is that the **const variables are evaluated at compile-time** and are immutable whereas **final variables are evaluated at runtime** and can only be set once.\n\n```dart\nfinal currentTime = DateTime.now(); // Runtime value\nconst pi",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us some examples of App State?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nSome examples of App State include:\n\n- Login info\n- Notifications in a social networking app\n- User preferences\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Can you tell us the difference between WidgetsApp and MaterialApp?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe main difference between **WidgetsApp** and **MaterialApp** is that the widget offers basic navigation, whereas MaterialApp is built on top of WidgetsApp.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Define factory constructors.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nA **factory constructor** invokes another constructor, which is allowed to return an instance of a derived class, null or an existing instance. Factory constructors are defined using the `factory` keyword.\n\n```dart\nclass Logger {\n  static final Map<String, Logger> _cache = {};",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Define the term Cookbook.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nA **cookbook** provides specific programming solutions for some common problems experienced by developers during the development process. Each recipe can be used independently during the development process.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between `Stream` and `Future` in Flutter.",
    "answer_preview": "**📚 GITHUB**\n\n`Stream` and `Future` are both used for asynchronous programming in Flutter, but they serve different purposes.\n\n`Future` is a one-time asynchronous operation that returns a single value. It represents a value that will be available in the future, either a result or an error. Futures a",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between setState and Provider?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe `setState()` is used for managing the **local state**. Calling the setState() function notifies the framework about the change in the state of the object and that may affect the user interaction in the subtree.\n\nWhereas, **provider** is a state management technique in Flut",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain async, await and Future.",
    "answer_preview": "**📚 GITHUB**\n\nThe `async` and `await` are keywords in Dart that enable asynchronous programming. They make it easier to write asynchronous code that is readable and easier to maintain.\n\n`Future` is a core Dart library that represents an asynchronous operation that will complete in the future. A `Fut",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain how you will deploy a Flutter app to the Google Play/App Store?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFor deploying Flutter apps to the Google Play Store or App Store, you will need to know the guidelines suggested by each. In both cases, it's important to make sure your app meets the requirements and guidelines of the respective app store before submitting it for review. This",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain setState() and when to call it",
    "answer_preview": "**📚 LEMON**\n\n`setState()` tells Flutter that the state of the widget has changed and the UI should be rebuilt. Use it when you want to update the visual representation of data. Call it whenever you modify state variables that affect what the widget displays.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain singleton class in flutter.",
    "answer_preview": "**📚 GITHUB**\n\nA singleton class is a class that can only be instantiated once throughout the entire application. It provides a single point of access to a shared instance of an object, which can be accessed from anywhere in the application.\n\nTo create a singleton class in Flutter, we need to define ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain Streams in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Future** and **Stream** are classes in Dart that define asynchronous programming. It behaves asynchronously as it doesn't return the next event when requested. Instead, it informs when the next event will be returned when ready.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain the `mounted` property. How is it important and when to use it?",
    "answer_preview": "**📚 GITHUB**\n\nThe mounted property defines whether the state object, associated with it, is currently in the widget tree.\n\nAfter creating a State object and before calling initState, the framework **\"mounts\"** the State object by associating it with a BuildContext. The State object remains mounted u",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain the Primary Axis and Cross Axis Alignment.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nAn alignment defines how a row or a column is aligned with respect to the horizontal or vertical axis. For example, for a row its main axis is horizontal and so its cross axis will be vertical.\n\n- **PrimaryAxisAlignment**: the rows run horizontally, and the columns run vertica",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Explain what a ticker is in flutter.",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, a ticker is a mechanism that helps to drive animations. It provides a continuous stream of time, essentially ticking at a fixed interval (typically the frame rate). This enables the animation framework to update the UI at a consistent rate.\n\nA `Ticker` is often used with `A",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How can you prevent a widget from rebuilding?",
    "answer_preview": "**📚 LEMON**\n\nSeveral strategies:\n- Use `const` constructors to create compile-time constants\n- Use `Keys` to preserve widget identity\n- Extract static widgets into separate const widgets\n- Use `RepaintBoundary` to isolate rebuilds\n- Implement `shouldRebuild` in custom widgets\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do mixins differ from interfaces in Dart?",
    "answer_preview": "**📚 GITHUB**\n\nIn Dart, mixins and interfaces serve different purposes:\n\n**Mixins:** Allow a class to reuse code from multiple classes without using inheritance. Mixins are typically used to add functionality to a class. They are declared using the mixin keyword and can be applied to a class via the ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you add padding or margin around a widget?",
    "answer_preview": "**📚 LEMON**\n\n- Use `Padding(padding: EdgeInsets.all(16))` to add internal spacing\n- Or wrap the widget in a `Container` with `margin` or `padding` properties\n\nBoth approaches allow you to add space around widgets.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you apply custom fonts in a Flutter app?",
    "answer_preview": "**📚 LEMON**\n\n1. Add the font files to your assets (usually in a `fonts/` directory)\n2. Declare them in `pubspec.yaml`:\n```yaml\nflutter:\n  fonts:\n    - family: CustomFont\n      fonts:\n        - asset: fonts/CustomFont-Regular.ttf\n        - asset: fonts/CustomFont-Bold.ttf\n          weight: 700\n```\n3.",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you create a rounded button in Flutter?",
    "answer_preview": "**📚 LEMON**\n\nUse an `ElevatedButton` with a custom shape such as `RoundedRectangleBorder` with a `borderRadius` property.\n\n```dart\nElevatedButton(\n  style: ElevatedButton.styleFrom(\n    shape: RoundedRectangleBorder(\n      borderRadius: BorderRadius.circular(20),\n    ),\n  ),\n  onPressed: () {},\n  ch",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you detect a button press?",
    "answer_preview": "**📚 LEMON**\n\nSet the `onPressed` callback in button widgets like `TextButton`, `ElevatedButton`, or `IconButton`:\n\n```dart\nElevatedButton(\n  onPressed: () {\n    // Handle button press\n  },\n  child: Text('Press Me'),\n)\n```\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you handle exceptions in Flutter, and what strategies have you used?",
    "answer_preview": "**📚 GITHUB**\n\nExceptions are errors that occur at runtime and can be handled in Flutter using `try-catch` blocks. Here's a simple example of how to handle exceptions in Flutter:\n\n```dart\ntry {\n  // Code that might throw an exception\n} on Exception catch (e) {\n  // Code that is executed when an excep",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you handle user input in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, we can handle user input through various widgets such as `TextField`, `Checkbox`, `Radio`, `Slider`, `DropdownButton`, `GestureDetector`, and more.\n\nHere is a simple process for handling user input in Flutter:\n\n1. Determine the widget that captures the user's input, such as",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you handle user input with TextField?",
    "answer_preview": "**📚 LEMON**\n\nUse a `TextEditingController` to read and manipulate input from a TextField. You can:\n- Access the current text value via `controller.text`\n- Listen for changes using `controller.addListener()`\n- Use the `onChanged` callback for real-time updates as the user types\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you implement a draggable widget in flutter?",
    "answer_preview": "**📚 GITHUB**\n\nTo implement a draggable widget in flutter, use the `Draggable` widget. Here's how to do it:\n\n- Use the `Draggable` widget to wrap the element you want to make draggable.\n- Pass the data you want to drag through the data property.\n- Use `feedback` to specify the widget that appears whi",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you load an image from the internet?",
    "answer_preview": "**📚 LEMON**\n\nUse `Image.network()` with the URL:\n\n```dart\nImage.network('https://example.com/image.jpg')\n```\n\nYou can optionally add:\n- `loadingBuilder` to show a loading indicator\n- `errorBuilder` to handle loading errors\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you navigate to a new screen in Flutter?",
    "answer_preview": "**📚 LEMON**\n\nUse the `Navigator.push()` method with a `MaterialPageRoute` to navigate to a new screen.\n\n```dart\nNavigator.push(\n  context, \n  MaterialPageRoute(builder: (_) => NewScreen())\n);\n```\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you provide accessibility when developing flutter apps, do you at all?",
    "answer_preview": "**📚 GITHUB**\n\nYes, accessibility is a critical aspect of Flutter app development to ensure that the app is usable by everyone, including users with disabilities. In Flutter, several techniques are available to enhance accessibility:\n\n- **Use of Semantic Widgets:** Flutter provides `Semantics` widget",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you show a dialog in Flutter?",
    "answer_preview": "**📚 LEMON**\n\nUse `showDialog()` with a widget like `AlertDialog`:\n\n```dart\nshowDialog(\n  context: context,\n  builder: (context) => AlertDialog(\n    title: Text('Dialog Title'),\n    content: Text('Dialog content'),\n    actions: [\n      TextButton(\n        onPressed: () => Navigator.pop(context),\n    ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you use FutureBuilder?",
    "answer_preview": "**📚 LEMON**\n\n`FutureBuilder` listens to a Future and rebuilds its child based on the connection state. It handles three main states:\n- **Waiting:** While the future is loading\n- **Done:** When the future completes successfully\n- **Error:** If the future completes with an error\n\nThis widget is ideal ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you use the `ValueNotifier` class in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, the `ValueNotifier` class is a simple class that provides a way to listen for changes to a value and update the UI accordingly. It's a convenient way to manage state for a small number of widgets, and is often used in combination with the `ChangeNotifier` and `Provider` cla",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How do you validate a form in Flutter?",
    "answer_preview": "**📚 LEMON**\n\n1. Wrap input fields in a `Form` widget\n2. Assign a `GlobalKey<FormState>()`\n3. Add `validator` functions to form fields\n4. Call `formKey.currentState!.validate()` to validate all fields\n\n```dart\nfinal formKey = GlobalKey<FormState>();\n\nForm(\n  key: formKey,\n  child: TextFormField(\n    ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How to create a list with persistent headers?",
    "answer_preview": "**📚 GITHUB**\n\nTo create a list with persistent headers in flutter, we can use the `CustomScrollView` widget along with `SliverList` and `SliverPersistentHeader`. This allows to have headers that remain visible as the user scrolls through the list.\n\nHere's how to do it:\n- Wrap the list and header in ",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How would you implement a custom transition between screens in Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nYou can use the **PageRouteBuilder** class to create custom transitions between screens. This class allows you to define custom animations, such as sliding or fading, for the page transition.\n\n```dart\nNavigator.push(\n  context,\n  PageRouteBuilder(\n    pageBuilder: (context, an",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "How would you optimize the performance of a Flutter app?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nSome techniques to optimize the performance of a Flutter app include:\n\n- Using the `const` keyword to make widgets immutable\n- Avoiding unnecessary widget rebuilds\n- Using the Provider package for efficient state management\n- Minimizing the number of expensive operations in th",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Is it possible to nest a Scaffold? Why or why not?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Yes, it is possible.** Scaffold is a widget, so you can put it anywhere you want. Scaffold provides APIs like Drawer, SnackBar, BottomNavigationBar, FloatingActionButton, etc. However, it is not necessary to nest scaffolds as they can be used on their own.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "List the responsibilities of FlutterActivity.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe roles of a **FlutterActivity** are:\n\n- Configuring the appearance of the status bar\n- Displaying Android launch screen\n- Displaying flutter splash screen\n- Choosing an execution path for the Dart app bundle\n- Adding transparency, which is an optional responsibility\n- Savin",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Name the different types of grid view in Flutter.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe different types of grid views in Flutter are:\n\n- `GridView.count()`\n- `GridView.custom()`\n- `GridView.builder()`\n- `GridView.extent()`\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "Tell me about Flutter Provider.",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nWidgets are used to build the provider. Inside the provider, one can use all the objects as if they are a part of it with the new widget subclasses it creates. Primarily, it works on the concept of **PUB-SUB** which means one provider with many subscribers.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "What are `StatefulWidget` Lifecycle methods. Explain briefly.",
    "answer_preview": "**📚 GITHUB**\n\n- **createState() method:** Whenever a StatefulWidget is created, the framework calls this method to create fresh State objects. This method must be overridden.\n\n- **initState() method:** This method is the first method that is called while creating a StatefulWidget class. Here we allo",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "What are DevTools in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\n`DevTools` in Flutter are a set of powerful web-based tools for debugging and profiling Flutter applications. They provide developers with detailed information about their apps, including CPU usage, memory usage, GPU rendering, and network activity. DevTools can be used to identify per",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "What are different build modes in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe Flutter tooling supports three different build modes while compiling the app. We need to choose the build mode depending upon where we are in the development cycle.\n\n- `debug`: For development purpose, the **hot reload** feature is enabled only in the debug mode.\n- `profile`: For a",
    "source": "INTERMEDIATE",
    "difficulty": "basic"
  },
  {
    "question": "What's the purpose of the build() method in Flutter?",
    "answer_preview": "**📚 LEMON**\n\nThe `build()` method describes how to display the widget using a tree of other widgets. It's called every time the UI needs to be updated. The method returns a widget tree that represents the visual structure of your widget.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "When do you use release mode and what's the function of release mode?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nA **release mode** is used when one needs to optimize and produce the codes without any debug data. The release mode is used for deploying the app.\n\nThe command used to compile the release mode is:\n```bash\nflutter run --release\n```\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What are keys and why do we need them?",
    "answer_preview": "**📚 GITHUB**\n\nFlutter uses keys to preserve the state and to uniquely identify specific widgets within a widget tree. It is used to preserve the state of the `StatefulWidget`s while they are being replaced with other widgets or just moved in the widget tree.\n\nThe most common usage of key is when we ",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What are keys in Flutter and why are they used?",
    "answer_preview": "**📚 LEMON**\n\nKeys preserve widget state when widgets are moved or change position in the widget tree. They are useful in:\n- Lists where items can be reordered\n- Animations\n- Any scenario where Flutter needs to identify and track specific widgets across rebuilds\n\nKeys help Flutter determine which wid",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What are mixins? How to use them?",
    "answer_preview": "**📚 GITHUB**\n\nA mixin is a class whose methods and properties can be used by other classes – without subclassing. It's a reusable chunk of code that can be plugged in to any class that needs this functionality.\n\nExample of a mixin:\n\n```dart\n// To create a mixin, use `mixin` keyword instead of `class",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the advantages of a Flutter Inspector?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe advantages of Flutter inspector are as follows:\n\n- **Widget mode**: With this button, you can choose different widgets from your application and inspect them one at a time. After choosing any Widget from the Widget Tree you can view the blueprint of that Widget with the he",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the advantages of using Flutter?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter has many advantages:\n\n- **Fast development**: With the help of Flutter, you can save a lot of time while developing software. Hot reload is a flutter feature with which you can make changes to your code and see the results in real time.\n- **Flexible user interface**: F",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the differences between JIT and AOT?",
    "answer_preview": "**📚 GITHUB**\n\nJIT stands for Just-in-Time vs AOT stands for Ahead-of-Time.\n\n- JIT compiles code during runtime. Used in development (e.g., hot reload) but has slower performance.\n- AOT compiles code before runtime (during build). Used in production for faster performance and optimized binary size.\n\n",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What are the various kinds of Streams present in flutter?",
    "answer_preview": "**📚 GITHUB**\n\nStreams in flutter are of two main types:\n\n**Single Subscription Stream**\n- Allows a single listener to subscribe at a time.\n- Suitable for sequential data processing, like events or user input.\n- Commonly used in situations like button clicks or network requests.\n\n**Broadcast Stream**",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What do you mean by Container class?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nThe **container class** is the convenience widget that enables positioning, sizing, and painting of widgets. A container class can include multiple widgets and it enables developers to manage those widgets according to their convenience.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What does ListView.builder do?",
    "answer_preview": "**📚 LEMON**\n\n`ListView.builder` builds list items lazily as they scroll into view. This improves performance for long lists by only creating widgets for visible items, resulting in efficient memory management. Items are created on-demand rather than all at once.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What does SafeArea do?",
    "answer_preview": "**📚 LEMON**\n\n`SafeArea` adds padding to avoid system UI elements such as:\n- Status bar\n- Notches\n- Home indicators\n- System navigation bars\n\nIt keeps content within safe visible bounds, ensuring your UI isn't obscured by system elements.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What does Stack do and when should it be used?",
    "answer_preview": "**📚 LEMON**\n\n`Stack` overlays widgets on top of each other. The first child is at the bottom, and subsequent children are painted on top. Use it for:\n- Complex UI layouts like banners\n- Image overlays\n- Free positioning of widgets\n- Creating layered designs\n\nChildren can be positioned using `Positio",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What does the main() function do in a Flutter app?",
    "answer_preview": "**📚 LEMON**\n\nThe `main()` function is the app's entry point. It's the first function that runs when your Flutter app starts. Usually, it calls `runApp(MyApp())` to inflate the widget tree and start the app.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `Animation` and `AnimationController`?",
    "answer_preview": "**📚 GITHUB**\n\n`Animation` is a way to describe a graphical representation of a changing value over time. It can be used to animate the properties of widgets, such as size, color, position, and opacity, to create smooth and visually appealing transitions.\n\n`AnimationController` is a central class in ",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `AppLifecycleState`?",
    "answer_preview": "**📚 GITHUB**\n\nThe `AppLifecycleState` defines the state that an application can be.\n\n- **detached (AppLifecycleState.detached):** This means the application is still hosted on flutter engine but is detached from any host views. It can either be in the progress of attaching a view when engine was fir",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `BuildContext` in Flutter? And why is it needed?",
    "answer_preview": "**📚 GITHUB**\n\n`BuildContext` is a locator that tracks and locates each widget in a widget tree. `BuildContext` objects are passed to **WidgetBuilder** functions, and are available from the `State.context` member. Some static functions (e.g. **showDialog**, **Theme.of**, and so forth) also take build",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `FutureBuilder` in Flutter and how is it used to build dynamic UI?",
    "answer_preview": "**📚 GITHUB**\n\n`FutureBuilder` is a widget in Flutter that allows us to build a dynamic UI based on the value of a Future. A Future is an asynchronous operation that returns a value in the future. For example, we might use a Future to retrieve data from a server, or to perform a long-running computat",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is `resizeToAvoidBottomInset`? When should we use it?",
    "answer_preview": "**📚 GITHUB**\n\nThe `resizeToAvoidBottomInset` is a property in the `Scaffold` widget. It is a boolean property that determines whether the body of the `Scaffold` should be resized to avoid the on-screen keyboard when it is displayed.\n\nIt should be used when the body of the `Scaffold` contains a form ",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is a `MediaQuery` in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, a `MediaQuery` is a widget that provides information about the device's screen size, orientation, and other display-related characteristics. It is typically used to create responsive UIs that adapt to different screen sizes and densities.\n\nThe `MediaQuery` widget is usually",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is a Container in Flutter?",
    "answer_preview": "**📚 LEMON**\n\n`Container` is a versatile box widget that combines common painting, positioning, and sizing widgets. It can have:\n- Padding\n- Margin\n- Decoration (borders, backgrounds, shadows)\n- Width and height constraints\n- Alignment\n\nIt's one of the most commonly used widgets for layout and stylin",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is a GlobalKey in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nA `GlobalKey` is a unique identifier for a widget in the widget tree, allowing the widget to be accessed and manipulated from outside of its parent or ancestor widgets. It is a class in the Flutter framework that can be used with stateful or stateless widgets to uniquely identify a wid",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is a StatefulWidget and when would you use it?",
    "answer_preview": "**📚 LEMON**\n\nA `StatefulWidget` is a widget with mutable state that can change during its lifetime. It is a built-in Flutter approach to make the UI dynamically update. Use it to create dynamic, interactive UI elements that need to update their visual representation based on user interaction or othe",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is Factory constructor?",
    "answer_preview": "**📚 GITHUB**\n\nA factory constructor in Flutter is a special type of constructor that returns an instance of a class, but it does not necessarily create a new object every time it's called. The purpose of a factory constructor is to allow classes to provide alternative ways to create objects without ",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is Flutter Architecture?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nFlutter architecture is comprised of three layers:\n\n### Flutter Framework Layer\nThis is the highest layer in the Flutter architecture and includes the widgets and the Material Design widgets. It also includes APIs for animations, gestures, and routing.\n\n### Engine Layer\nThis i",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is MediaQuery.of(context).size used for?",
    "answer_preview": "**📚 LEMON**\n\n`MediaQuery.of(context).size` gets the device screen dimensions (width and height). It's useful for:\n- Creating responsive designs\n- Adapting layouts to different screen sizes\n- Calculating widget sizes based on screen dimensions\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is SingleChildScrollView and when do you use it?",
    "answer_preview": "**📚 LEMON**\n\n`SingleChildScrollView` is a scrollable container for a single widget (like a `Column`). Use it when the content might overflow vertically and needs to be scrollable. It's ideal for forms or layouts that might exceed the screen height.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is sound null safety?",
    "answer_preview": "**📚 GITHUB**\n\n**Sound null safety** makes types in code non-nullable by default and enables special static checks and compiler optimizations to guarantee that null-dereference errors won't appear at runtime because they will be spotted at compile-time and fixed.\n\n**Null safety** is a guarantee withi",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is State Management in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nState management in Flutter refers to the management of the state of widgets and their properties in a Flutter app. State management is an essential concept in Flutter because it allows developers to create dynamic and interactive user interfaces that respond to user input and changes ",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between `Expanded` and `Flexible` widget?",
    "answer_preview": "**📚 GITHUB**\n\nThe only difference between these two widgets is the `Flexible` widget takes only the space needed by the child, whereas the `Expanded` widget enforces its child to take all the available space.\n\nThe `Expanded` widget in flutter is shorthand of `Flexible` with the fit set to **FlexFit.",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between `NetworkImage` and `Image.network` in flutter?",
    "answer_preview": "**📚 GITHUB**\n\n`NetworkImage` class creates an object that provides an image from the src URL passed to it. It is not a widget and does not output an image to the screen.\n\n`Image.network` creates a widget that displays an image on the screen. It is just a named constructor on the **Image** class. It ",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between `WidgetsApp` and `MaterialApp` in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\n`WidgetsApp` is a convenient widget that wraps a number of widgets that are commonly required for an application. It also provides basic navigation.\n\n`MaterialApp` builds an application that uses the mterial design. It is built upon the `WidgetsApp` and contains some material-design sp",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between Column and ListView?",
    "answer_preview": "**📚 LEMON**\n\n- **Column:** Lays out all children vertically at once. Non-scrollable by default. Best for a fixed number of children.\n- **ListView:** Scrollable and efficient for long or dynamic content. Creates children lazily on demand.\n\nUse `Column` for simple layouts, `ListView` for scrollable li",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between Expanded and Flexible?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Flexible** takes the least space needed to fit in a child widget. On the other hand, **Expanded** takes the rest of the size in the widget.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between final and const?",
    "answer_preview": "**📚 LEMON**\n\n- `final`: Assigned once at runtime. The value is set when the object is created and cannot be changed afterward.\n- `const`: Assigned at compile-time and is deeply immutable. The value must be known at compile time.\n- **Recommendation:** Use `const` for performance optimization where po",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between hot reload and hot restart?",
    "answer_preview": "**📚 LEMON**\n\n- **Hot reload:** Injects new code into the Dart VM and preserves the current state. It's fast and maintains your app's current state.\n- **Hot restart:** Fully rebuilds the app and resets all state. It's a complete restart of the application.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between MainAxisAlignment and CrossAxisAlignment?",
    "answer_preview": "**📚 LEMON**\n\n- **MainAxisAlignment:** Aligns children along the main axis (horizontal in Row, vertical in Column)\n- **CrossAxisAlignment:** Aligns children along the perpendicular/cross axis\n\nThese properties control how children are positioned within `Row`, `Column`, and `Flex` widgets.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the difference between Provider vs. InheritedWidget?",
    "answer_preview": "**📚 GITHUB**\n\nProvider and InheritedWidget are both ways to share data between widgets in Flutter, but they differ in their implementation and approach.\n\nInheritedWidget is a built-in widget in Flutter that allows the sharing of data between widgets in a tree structure. It works by creating a tree o",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the event loop?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, the event loop is a mechanism used to manage the flow of events and callbacks in an application. The event loop runs on a single thread and is responsible for processing events, such as user input or network I/O, and executing any associated callbacks.\n\nThe event loop works",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the extension method in Dart?",
    "answer_preview": "**📚 GITHUB**\n\nExtension method allows us to add new functionality on top of existing libraries.For example, you can add extra functionality to the Dart core String library, that are only available in your app.\n\nSyntax to create an extension method:\n\n```\nextension <extension name> on <type> {\n  // (<",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the lifecycle of a StatefulWidget?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nA StatefulWidget's lifecycle is as follows:\n\n1. `createState`\n2. `initState`\n3. `didChangeDependencies`\n4. `build`\n5. `didUpdateWidget`\n6. `setState`\n7. `deactivate`\n8. `dispose`\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `AnimatedBuilder` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `AnimatedBuilder` widget in Flutter is used to create complex animations by separating the animation logic from the widget tree. It provides a builder function that returns a widget tree, and an animation object that can be used to animate the properties of the widgets in the tree.",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `AnimatedSwitcher` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `AnimatedSwitcher` widget in Flutter is used to create animated transitions between two or more widgets. The purpose of the `AnimatedSwitcher` widget is to provide an easy-to-use way to animate changes in the widget tree. When you use the `AnimatedSwitcher`, you can specify a new c",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `didUpdateWidget` method in a StatefulWidget?",
    "answer_preview": "**📚 GITHUB**\n\nIn Flutter, `StatefulWidget` is a widget that has mutable state that can change over time. When the state of a `StatefulWidget` changes, the framework rebuilds the widget tree to reflect the new state.\n\nThe `didUpdateWidget` method is a lifecycle method that is called when the framewor",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the `LayoutBuilder` widget in Flutter?",
    "answer_preview": "**📚 GITHUB**\n\nThe `LayoutBuilder` widget in Flutter is used to get the constraints of the parent widget and build child widgets based on these constraints.\n\nThe purpose of `LayoutBuilder` is to enable creating responsive UIs that adapt to the size of their parent widget. The `LayoutBuilder` widget p",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the initState() method?",
    "answer_preview": "**📚 LEMON**\n\n`initState()` is called once when the widget is inserted into the widget tree. Use it to:\n- Initialize data\n- Set up listeners\n- Start animations\n- Subscribe to streams\n- Perform one-time setup operations\n\nIt's called before the first `build()` call.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the Navigator in Flutter and how is it used?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Navigator** is a widget in Flutter that manages a stack of screens or \"routes\" in an application. It is used to navigate between different screens and to manage the state of the navigation stack. Navigator is typically used in conjunction with MaterialApp or CupertinoApp to ",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is the purpose of the pubspec.yaml file?",
    "answer_preview": "**📚 LEMON**\n\nThe `pubspec.yaml` file is the configuration file where you declare:\n- Project metadata (name, description, version)\n- Dependencies (packages your app uses)\n- Assets (images, fonts, other files)\n- Font declarations\n- Flutter SDK constraints\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is Typedef in Dart?",
    "answer_preview": "**📚 GITHUB**\n\nThe `typedef` in Dart is a way to define a new type alias for a function type. It allows us to give a name to a function type and use that name to declare variables, function parameters, or return types. A `typedef` is useful when we want to refer to a complex function type multiple ti",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What's the difference between container and sizedBox?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\nContainer and SizedBox are both widgets in Flutter that can be used to size and position child widgets, but they have some differences.\n\nThe **Container** widget is a multi-purpose widget that can be used to apply decoration, padding, margin, and constraints to a child widget.",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What's the need of mixins?",
    "answer_preview": "**📚 TURINGQUESTIONS**\n\n**Multiple inheritances are not supported in Dart.** Hence, you would need **mixins** to use multiple inheritance in Flutter, as they allow you to write reusable class code in multiple class hierarchies.\n\n```dart\nmixin Musical {\n  void playInstrument() {\n    print('Playing mus",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What's the purpose of Expanded?",
    "answer_preview": "**📚 LEMON**\n\n`Expanded` forces a child of `Row`, `Column`, or `Flex` to take up all remaining available space. It's used to fill available space in flex layouts and can accept a `flex` parameter to control how much space it takes relative to other `Expanded` widgets.\n\n---",
    "source": "INTERMEDIATE",
    "difficulty": "intermediate"
  },
  {
    "question": "What is Flutter?",
    "answer_preview": "Flutter is a UI-based tool for creating mobile applications. You can use Flutter to create natively compiled mobile applications with a single programming language and a single codebase. Fast and beautiful mobile applications can be developed with the right skill sets to code in Flutter. Google deve",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are the advantages of using Flutter?",
    "answer_preview": "Flutter has various advantages to coding mobile apps:\n\n- **Reduce the amount of code**: Hot reload feature provided by Flutter helps in faster performance. The app is coded in C/C++ code to make it as close to machine code as possible for faster app development. The widget availability in Flutter re",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What is the Flutter architecture?",
    "answer_preview": "Flutter has a three-layered architecture:\n\n1. **Upper Layer**: The upper layer consists of the Dart programming language along with the widgets, animations, illustrations, customizations, etc.\n2. **The middle layer or the Flutter Engine**: This layer deals with text display, formatting, layout, etc.",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What build modes are available in Flutter?",
    "answer_preview": "Flutter is made up of three build modes:\n\n- **Debug Mode**: This mode is for debugging apps on a device or a simulator\n- **Profile Mode**: Some debugging abilities are available, along with an analysis of app's performance in testing rounds\n- **Release Mode**: This mode is used when deploying the ap",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What is the Dart programming language?",
    "answer_preview": "Dart is an object-oriented programming language with a syntax like the C Language. The language is open source and was developed by Google in 2011. The language was conceptualized to code the mobile app frontend. The app is used for coding frontend user interfaces. Flutter apps make use of the Dart ",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Is Dart language necessary for Flutter?",
    "answer_preview": "It is compulsory to know the Dart language to use Flutter. Flutter applications make use of the Dart language for coding mobile phone apps.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are widgets in Flutter?",
    "answer_preview": "Flutter apps make use of widgets to code mobile phone applications. You will almost exclusively build on Flutter using widgets. Widgets define the view of the app. When you change the code, the widget code is automatically adjusted. Widgets are nested with each other to get the final design of the a",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are the most useful editors for Flutter apps?",
    "answer_preview": "Flutter tools make use of plugins to code mobile phone apps. The plugins can help in Dart code compilation, analysis of the code, and development of apps.\n\n### Some used Flutter tools for IDE development are:\n\n- Visual Studio\n- Android Studio\n- Xcode\n- IntelliJ IDEA\n- Eclipse\n- Emacs\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are packages and plugins in Flutter?",
    "answer_preview": "Similar types of classes, interfaces, and sub-packages are known as packages in Flutter or any other object-oriented language. The packages and plugins are used in development to reduce the coder's effort. The coder need not write the code for everything and can use packages and plugins to reduce th",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Are there any popular apps which make use of Flutter?",
    "answer_preview": "There are many popular apps which use Flutter. Some of the apps are:\n\n- Reflectly\n- Google Ads\n- Alibaba\n- Tencent\n- Birch Finance\n- And many more\n\nThe use of Flutter in mobile applications is very high.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are the Advantages of using Flutter?",
    "answer_preview": "- Flutter offers flexibility and expressive UI with the faster performance provided by Flutter's code - Hot reload feature\n- A wide variety of users can get access and internationalization with the help of Flutter code to web applications\n- Flutter widgets come with native performance on both Androi",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Explain the Flutter Architecture",
    "answer_preview": "Flutter architecture is made up of three layers:\n\n- **Upper Layer**: It has Dart programming language including the widgets, animations, illustrations, customizations, etc.\n- **The middle layer**: It is also called the Flutter Engine used for text display, formatting, and layout\n- **Bottom Layer**: ",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What build modes are available in Flutter?",
    "answer_preview": "Flutter has 3 build modes: **Debug Mode**, **Profile Mode**, and **Release Mode**.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What is the Dart programming language? Explain in detail",
    "answer_preview": "Your preparation for the flutter interview questions is incomplete, if you don't know about the dart programming language. Because, flutter doesn't exist without Dart Programming language. Dart programming language is object-oriented, open source, and quite similar to the syntax of C language, and d",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are the limitations of Flutter?",
    "answer_preview": "Following are the limitations of a flutter:\n\n- Lack of third-party libraries\n- Larger release size\n- Flutter works with Dart language which is not so advanced as C# or C-Sharp and JavaScript\n- Not so user-friendly for iOS developers as it is developed by Google and it takes time to resolve the issue",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "The most useful editors for Flutter apps",
    "answer_preview": "The most useful editors for Flutter apps are:\n\n- Visual Studio\n- Android Studio\n- Xcode\n- IntelliJ IDEA\n- Eclipse\n- Vim\n- Emacs\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are widgets in Flutter?",
    "answer_preview": "Widgets in Flutter are nested with each other to get the final design of the app. Widgets are used to code mobile phone applications.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are the popular apps which make use of Flutter?",
    "answer_preview": "Some of the most popular apps using Flutter are:\n\n- Reflectly\n- Google Ads\n- Alibaba\n- Tencent\n- Birch Finance\n- Coach Yourself\n- Watermaniac\n\nIn general, Flutter is used to develop android, iOS, Linux, Mac, and Web applications from a single codebase or with high brand designs.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are the resources to learn Flutter?",
    "answer_preview": "You can learn flutter from Flutter Documentation available as open source on Google.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "In What technology is Flutter built?",
    "answer_preview": "Flutter is built using:\n\n- C\n- C++\n- Skia - 2D rendering engine\n- Dart - object-oriented language\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Difference between runApp() and main() in flutter",
    "answer_preview": "| main() | runApp() |\n|--------|----------|\n| It is a function used to start the program | It is used to return the widgets that are connected to the screen as the root of the widget tree to be rendered on the screen |\n| In Flutter, it is impossible to write any program without the main() function |",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What is the App state?",
    "answer_preview": "App State is a shared state or application state. App states can be shared across sections of your app and maintain user sessions in the same way.\n\n### App state includes activities such as:\n\n- Login info\n- User preferences\n- E-commerce shopping cart\n- Social networking notifications\n- etc.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What are packages and plugins in Flutter?",
    "answer_preview": "| Packages | Plugins |\n|----------|---------|\n| It is used as native code in Flutter | It is a new code or components written in the dart programming language |\n| It enables more usability of the device | The specific distinctions between the plugins and packages are made only during creating a new ",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What do you mean by keys in flutter?",
    "answer_preview": "Keys in flutter are identifiers for widgets, elements, and semantic nodes, whereas GlobalKeys and LocalKeys are the subclasses of Key.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Uses of keys in Flutter?",
    "answer_preview": "Keys in flutter are used primarily to:\n\n- Preserve the state of modified widgets in the widget trees\n- Reorganize and modify the collections of widgets having equivalent types and defined states\n- It does not modify a tree that consists of only stateless widgets\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What is a container class in a flutter?",
    "answer_preview": "A container class in flutter is a widget having the capacity to accommodate multiple child widgets and manage them efficiently through dimensions, padding, and background color.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What is Flutter Inspector?",
    "answer_preview": "The Flutter Inspector is a powerful tool used to visualize the blueprint of your widgets and their properties in Flutter.\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Benefits of Flutter Inspector",
    "answer_preview": "Flutter Inspector can:\n\n- Select widget mode in a widget tree\n- Provide the toggle platform\n- Show paint baselines and debug paint\n- Refresh the widgets as well as show or hide the performance overlay\n\n---",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Different types of streams in Dart",
    "answer_preview": "There are two types of streams in Dart: **Single Subscription Streams** and **Broadcast Streams**.\n\n### Single Subscription Streams\n\n- The events within a larger whole are delivered sequentially with single subscription streams\n- They are used for events that are in received matters or for reading a",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "When should you use mainAxisAlignment and crossAxisAlignment?",
    "answer_preview": "The crossAxisAlignment and mainAxisAlignment are used to control how a row and column widget aligns with their children depending on our choice.\n\n### mainAxisAlignment\n\nIn mainAxisAlignment, the rows will run horizontally whereas the columns will run vertically.\n\n### crossAxisAlignment\n\nIn crossAxis",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "What is the difference between SizedBox and Container?",
    "answer_preview": "### SizedBox\n\n- The SizedBox widget in Flutter has a specified size\n- In SizedBox, we cannot set the color or decoration for the widget\n- We can only use it with a child widget having a specific width or height\n\n### Container\n\n- The Container in Flutter is a parent widget containing multiple child w",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  },
  {
    "question": "Differentiate between Hot Restart and Hot Reload?",
    "answer_preview": "### Hot Restart\n\n- It sets the state value as default by destroying the preserved state value\n- So if you are using States value in your application then after every hot restart the developer gets a fully compiled application and all the states will be set to their defaults\n- Hot Restart uses comple",
    "source": "SIMPLILEARN",
    "difficulty": "basic"
  }
]